
[
  {
    "title": "Honey Mustard Chicken Wings Recipe",
    "description": "These Honey Mustard Chicken Wings are a go-to party snack. Marinate them with honey, mustard, and soy sauce, and then roast them in the oven. No deep-frying required!",
    "prepTime": "7 minutes",
    "cookTime": "30 minutes",
    "yeild": "2 to 3 servings",
    "ingredients": "\n8 cloves garlic, peeled and crushed\n2 tablespoons honey\n2 tablespoons Dijon mustard\n1 tablespoon tamari soy sauce (or 1 1/2 Tbsp regular soy sauce, use gluten-free soy sauce or tamari for gluten-free version)\n2 tablespoons lemon juice\n1/4 cup extra virgin olive oil\n2 teaspoons salt\n1 teaspoon freshly ground pepper\n20 chicken wing drummettes\n",
    "directions": "1 Marinate the chicken wings: Rinse and pat dry the chicken wings. Place them in a large bowl or marinade bag.\nMix together the marinade ingredients—crushed garlic cloves, honey, mustard, soy sauce, lemon juice, olive oil, salt and pepper—and pour over the chicken wings to coat.\nChill for at least an hour or up to 24 hours.\n2 Roast the wings: Preheat oven to 400°F. Line a roasting pan with foil and place a baking rack over it.\nPlace the chicken wings in on the rack in a single layer with some space between the wings.\nBake for 25-35 minutes, depending on the size of the chicken wings, until cooked through and well browned.\n\n \n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/09/honey-mustard-drummettes-vertical-1.jpg"
  },
  {
    "title": "Easy Chicken Skillet Enchiladas Recipe",
    "description": "These chicken skillet enchiladas are easy to make and ready in 30 minutes. They also use only one pan and are great to double and freeze for a meal down the road!",
    "prepTime": "10 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 servings",
    "ingredients": "\n8 ounces cooked chicken (about 2 cups shredded)\n1 teaspoon oil\n1/4 yellow onion, minced (about 1/3 cup)\n3 cloves garlic\n15-ounce can tomato sauce\n1/3 cup water\n4-ounce can mild green diced chilis\n2 teaspoons chili powder\n1 teaspoon oregano\n1/2 teaspoon cumin\n8 taco-sized flour tortillas\n8 ounces cotija cheese\n\nCilantro\nRadishes, thinly sliced\nSour cream\nAvocado\nJalapeño\n12-inch skillet",
    "directions": "1 Shred chicken: Shred the leftover chicken so it’s ready when you need it. You should have about 2 cups.\n\n2 Make the sauce: In a large, high-sided skillet set over medium heat, add the oil. Once the oil shimmers, add onion and garlic and cook for 1 minute, just until softened.\nAdd tomato sauce, water, diced green chilis, chili powder, oregano, and cumin. Stir together, then let the sauce simmer on medium to medium-low while you assemble the enchiladas.\n3 Assemble the enchiladas: Put about 2 tablespoons of shredded chicken down the center of each tortilla. (You don’t really have to measure the meat. Just divide it evenly among the tortillas!) Sprinkle about 1 tablespoon cotija cheese (just eyeball it) across the chicken, and spoon 1-2 teaspoons sauce over the cheese.\nFold in the sides of the tortilla, roll it up, and put it seam side down in the sauce. Nestle them in the pan. Repeat this until the pan is full. Spoon sauce over the top of the enchiladas.\n   \n4 Top with cheese and cover: Sprinkle additional cotija cheese over the top of the enchiladas. Cover with a lid and let them simmer until the cheese is melted and the tortillas look puffy, like they soaked up some sauce. This should take about 5 minutes.\n \n5 Garnish and serve: Lift the lid and sprinkle cilantro and thinly sliced radishes over the top. Serve alongside sliced avocado, jalapeño, and sour cream.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/05/Skillet-Chicken-Enchiladas-LEAD-1.jpg"
  },
  {
    "title": "Chicken Piccata Pasta Recipe",
    "description": "Chicken piccata gets the full pasta treatment! Cook the penne, make a quick butter sauce, and assemble it all together. This easy lemony chicken dish will wow your kids!",
    "prepTime": "15 minutes",
    "cookTime": "25 minutes",
    "yeild": "6 servings",
    "ingredients": "\n1 pound penne pasta\n3/4 cup all-purpose flour\n1 1/4 teaspoons salt\n1 teaspoon freshly ground black pepper\n2 large eggs\n1 1/2 pounds boneless, skinless chicken breasts, sliced into cutlets about 3/4-inch thick\n1/2 cup olive oil\n2 tablespoons butter\n1 small white onion, diced\n2 cloves garlic, sliced\n1/2 cup chicken stock\nJuice from 1 lemon (about 3 tablespoons of juice)\n1/4 cup capers\n1/4 cup fresh minced parsley\nSalt and pepper, to taste\n\n2 tablespoons butter\n2/3 cup Italian breadcrumbs\n1/4 teaspoon salt\n1/4 teaspoon freshly ground black pepper\n",
    "directions": "1 Cook the pasta: Bring a large pot of heavily salted water to a boil, and add the pasta. Cook until al dente, 8 to 10 minutes or according to package instructions. Scoop out and reserve about 1/2 cup of the pasta-cooking water, and then drain the pasta. Set aside.\n2 Make the Dad Add – Buttered Breadcrumbs: In a small skillet, melt the butter over low heat. Add breadcrumbs and stir them well so they evenly soak up the butter.\nCook on low heat until the breadcrumbs start to brown, about 3 minutes. Stir occasionally to prevent burning. Watch them closely, as they can go from perfect to burned quickly.\n\n3 Prep the chicken: Mix together the flour, salt, and pepper in a shallow bowl. Whisk the eggs in a second shallow bowl. Dip the chicken breasts first in the egg and then coat them with the flour mixture. They should have a very light coating on them. Let chicken rest on a plate.\n\n4 Fry the chicken: Heat the olive oil in a large skillet over medium heat. When the oil sizzles immediately when you sprinkle a little flour in it, it's ready. Add the chicken pieces and cook for 4 to 5 minutes per side (8 to 10 minutes total). Check cooked chicken with a meat thermometer to make sure it reaches an internal temperature of 165°F.\nRemove chicken from the skillet, and let it rest while you finish the dish.\n\n5 Make the piccata sauce: Pour out all but about 2 tablespoons of the oil in the skillet, and add the 2 tablespoons butter. Turn the heat down to medium-low, and add onions and sliced garlic. Stir the veggies, cooking for a few minutes until they soften.\nAdd chicken stock and lemon juice, and using a wooden spoon, scrape up any bits stuck to the pan.\n\n6 Finish the dish: Add the cooked penne to the skillet. Toss the penne with the lemon butter sauce. If the pan seems dry, add enough of the reserved 1/2 cup pasta cooking water so the pasta no longer seems dry.\nAfter the chicken has cooled slightly, chop the skillet fried chicken into big chunks, and add back into the penne mixture. Garnish with fresh parsley and capers.\n\n7 Garnish and serve: Serve the penne while warm, topping each bowl with the crispy buttered Italian breadcrumbs.\nThis dish keeps great in the fridge for 3 to 4 days. If you can plan ahead on the portion you will keep for leftovers, it’s best to actually store the chicken and pasta separately. Otherwise, the chicken will get soggy. Reheat the chicken in a 350°F oven for about 8 minutes, and then chop and add to reheated penne pasta.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/04/EYF-Chicken-Piccata-Penne-LEAD-5.jpg"
  },
  {
    "title": "Creamy Dijon Mustard Chicken Recipe",
    "description": "This chicken with creamy dijon mustard sauce is an easy and fast weeknight meal. The chicken cutlets and sauce are all cooked in the same skillet, making clean-up a breeze.",
    "prepTime": "15 minutes",
    "cookTime": "20 minutes",
    "yeild": "3 to 4 Servings",
    "ingredients": "\n1 to 1 1/4 pound boneless, skinless chicken breasts\nSalt\n2 tablespoons olive oil + more for lightly coating chicken\n1 tablespoon butter\n1 cup sliced shallots\n1/2 cup dry white wine (can sub chicken stock)\n1/2 cup water\n4 tablespoons Dijon mustard, smooth, whole grain, or a mixture of both\n1 teaspoon dried thyme\n1/4 cup heavy cream\n",
    "directions": "1 Cut chicken breasts and pound thin: Remove chicken breasts from package and sprinkle with salt. Remove the tenderloin from each breast and set aside. Cut each chicken breast into 3 pieces, approximately the same size. Coat with just a little olive oil.\nPlace the breast pieces between two pieces of plastic wrap or parchment paper and use a mallet, empty wine bottle, or rolling pin to pound the chicken pieces to an even thinness of about 1/4 inch. Repeat with the tenderloin pieces.\n\n2 Lightly brown the chicken cutlets: In a large, heavy-bottomed sauté pan, heat the olive oil on medium high to high heat. Stir in the butter. When the butter is foamy, add the chicken pieces to the pan. Do not crowd the pan, if necessary work in batches.\nLightly brown chicken on one side, turn over and brown the other side. Do not overcook the chicken. The pieces are thin and they will cook quickly. Remove the chicken pieces from the pan and set aside while you make the sauce.\n \n3 Cook the shallots: Add sliced shallots to the pan. Lower the heat to medium. Stir to coat with the remaining fat in the pan. Cook until softened, about 5 to 6 minutes.\n \n4 Make the sauce: Add white wine to the pan and increase the heat to high. When most of the wine has evaporated, add the water, the mustard, and the dried thyme. Simmer until reduced by half.\n \n5 Add chicken back to pan, drizzle in cream: Reduce the heat to low. Add the chicken back to the pan and coat with the sauce. Remove the pan from heat and drizzle in the cream. Taste and adjust seasonings, adding more salt if necessary.\n \n6 Serve: Serve with egg noodles, rice, mashed potatoes, puréed celery root or parsnips, or serve alone or with vegetables for low carb version.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/01/creamy-dijon-mustard-chicken-vertical.jpg"
  },
  {
    "title": "The Best Dry Brined Roast Chicken Recipe",
    "description": "Dry-brined roasted chickens are the best way to get succulent, juicy meat, and crispy, golden skin! The best part? You only need 5 minutes and some space in the fridge! ",
    "prepTime": "5 minutes",
    "cookTime": "1 hour, 20 minutes",
    "yeild": "4 Servings",
    "ingredients": "\n1 5- to 6-pound chicken\n1 lemon\n2 tablespoons olive oil\n2 3/4 teaspoons kosher salt\n1 1/4 teaspoons freshly cracked pepper\n1 1/4 teaspoons dried thyme\n",
    "directions": "1 Prepare the pan: Line a rimmed baking sheet with foil and set a baking rack on top or use a roasting pan with a roasting rack.\n2 Make the spice rub: Zest and quarter the lemon. Combine the lemon zest, juice from 1/4 of the lemon, 1 tablespoon olive oil, 2 1/2 teaspoons salt, pepper and thyme together in a small bowl.\nSave the lemon quarters (even the one you squeezed dry) to insert into the cavity.\n3 Season the chicken: Pat the outside of the chicken dry with a paper towel. Slide your fingers between the skin and the breast meat to loosen the skin. Try to separate the skin from around the legs as well.\nRub 3/4 of the spice mixture under the skin and into the breast and leg meat. Rub the remaining spice mixture inside the cavity of the bird. Insert the lemon quarters in the cavity.\n \n4 Truss the chicken: To truss the chicken, cut a piece of kitchen twine about 15 inches long. Tuck the wings under the bird as best you can. Center the twine under the back end of the chicken so equal lengths of twine are where you tucked the wings in.\nLift up each side of the twine crossing it over the top of bird’s body, wrap it around the legs. Tie the legs together.\n  \n5 Let the chicken air dry for 24 hours: Place the bird, baking sheet and all, into your refrigerator uncovered for 24 to 72 hours. If you don’t have the room in your refrigerator it’s ok to put the chicken on a plate and transfer it to the baking sheet when you’re ready to roast the bird.\n\n6 Prepare the oven: When ready to roast, move your oven rack to the second lowest spot in the oven. Preheat the oven to 375° F degrees.\n7 Add extra seasonings: The chicken will look a little desiccated after the 24-72 hour rest. That’s a good thing! It means your chicken will have crispy skin!\nTransfer the baking sheet from the fridge to the counter. Rub the outside of the chicken with 1 tablespoon of olive oil, a 1/4 teaspoon of kosher salt, and a few cracks of fresh ground pepper.\n\n8 Roast and baste the chicken: Place the baking sheet into the oven and roast for 1 hour at 375° F degrees. Then turn the oven up to 425° F degrees for the remaining 20 minutes or until the temperature in the thickest part of the breast reaches 160° F degrees.\nCheck the chicken at the 45-minute mark and baste it. You may have to tip the pan a little to the corner to get to the juices. If you don’t have a baster don’t worry, just use a long-handled spoon to scoop up and pour the drippings over the chicken.\nContinue to baste every 15 to 20 minutes until it reaches a deep, rich, golden color, the skin is crispy, and the chicken has finished cooking through.\n\n9 Rest the chicken: Remove the chicken from the oven when the temperature in the thickest part of the breast reads about 160°F. Let it rest for 5 minutes. The temperature will continue to rise to reach 165°F.\nIf you don’t have a thermometer that’s ok. The chicken is cooked through when you slice into it and the juices run clear.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/03/HT-Make-Roast-Chicken-LEAD-2v2.jpg"
  },
  {
    "title": "Matzo Ball Soup Recipe",
    "description": "Homemade matzo ball soup for Passover or anytime! Fluffy matzo balls in a light, clear broth. Add chicken meat for a heartier meal.",
    "prepTime": "15 minutes",
    "cookTime": "50 minutes",
    "yeild": "4 servings",
    "ingredients": "\n2 large eggs\n2 tablespoons schmaltz (chicken fat), melted, or any neutral-flavored oil\n2 tablespoons water\n1 teaspoon kosher salt\n1/4 teaspoon ground black pepper\n1/2 cup matzo meal\n\n6 cups chicken stock, homemade or store-bought\n1 large carrot, peeled and sliced thinly (about 1/8-inch thick)\n2 inner ribs of celery, peeled and sliced thinly (about 1/8-inch thick)\n\n1 tablespoon chopped fresh parsley or dill\nGround black pepper\n",
    "directions": "1 Make the matzo ball mixture: Make the matzo ball mixture: In a medium mixing bowl, whisk together the eggs, schmaltz, water, salt, and pepper. Stir in the matzo meal. Cover the bowl tightly and chill it in the fridge for at least two hours, or up to a day ahead.\n \n2 Shape and cook the matzo balls: In a large saucepan or soup pot, bring 3 quarts of water and 1 1/2 teaspoons of salt to a boil. When the water is boiling, turn the heat down to medium-low.\nUse your hands to roll the matzo ball mixture into approximately 1-inch balls. As you finish rolling each ball, gently drop it into the simmering water.\nWhen all of the matzo balls are in the water, immediately cover the pot and reduce the heat to low. Let the matzo balls simmer, covered, for 40 minutes, until they have floated to the top and roughly doubled in size. Avoid uncovering the pot while the matzo balls are cooking (a covered pot helps the matzo balls cook more evenly and quickly).\n  \n3 Warm the broth and vegetables: While the matzo balls are simmering, bring the chicken broth up to a simmer in a medium (3-quart) saucepan over medium heat. Add the sliced carrots and celery and reduce the heat to low.\nSimmer the vegetables in the broth until they’re tender, about 5 minutes. Turn off the heat and keep the broth covered so it stays hot while the matzo balls finish cooking.\n \n4 Serve the soup: Use a slotted spoon to transfer three matzo balls into each soup bowl, then ladle 1 1/2 cups of broth into each bowl. Garnish each bowl with a sprinkle of parsley or dill and a few grinds of black pepper. Serve piping hot.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/03/2017-04-03-MatzoBallSoup-14.jpg"
  },
  {
    "title": "Kung Pao Chicken Recipe",
    "description": "Skip take-out and make this Kung Pao Chicken at home! This spicy, sweet Chinese stir-fry is made with hot chilis, Szechwan peppercorns, garlic, ginger, and unsalted peanuts. Serve with rice for a weeknight meal.",
    "prepTime": "15 minutes",
    "cookTime": "10 minutes",
    "yeild": "4 Servings",
    "ingredients": "\n2 teaspoons soy sauce\n1 1/2 teaspoons sherry, or Shaoxing rice wine\n1 tablespoon water\n2 teaspoons cornstarch\n\n3 teaspoons Chinkiang vinegar, or 2 teaspoons of apple cider vinegar\n2 teaspoons soy sauce\n1 teaspoon sesame oil\n1 tablespoon water\n3 teaspoons sugar\n1 teaspoon cornstarch\n\n2 large boneless, skinless chicken breasts\n8 dried chili red peppers (preferably Tien Tsin variety)\n2 1/2 tablespoons sesame oil\n1 teaspoon whole Szechwan peppercorns (optional)\n1 tablespoon freshly grated ginger\n3 cloves garlic, thinly sliced\n6 green onions, chopped\n2/3 cup roasted, unsalted peanuts\n",
    "directions": "1 Marinate chicken: Mix together the marinade ingredients. Chop the chicken into bite sized pieces, toss them in the marinade, and set aside.\n2 Whisk together sauce ingredients: Combine all the ingredients for the sauce, whisking well to ensure the cornstarch is fully incorporated. Set aside.\n3 Prep the seasonings: Break the chilies open and discard the seeds inside, then cut them into a few large pieces (the dish will already be very hot, keeping the seeds will make it near inedible).\n4 Stir-fry chilies and peppercorns: Place the 2 1/2 tablespoons of sesame oil in a wok or large sauté pan and place over medium-high heat. Add the chilies and Szechwan peppercorns, if using. Stir-fry for a few second until they become fragrant being careful not to burn them.\n5 Add the chicken and aromatics: Add the chicken. As soon as the pieces have separated, add the ginger, garlic, and green onions. Stir-fry for a few minutes until the chicken is cooked through.\n6 Finish the stir fry: Add the sauce and toss. When the sauce becomes thick, add the peanuts, toss, and serve.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/06/kung-pao-chicken-vertical-a-1200.jpg"
  },
  {
    "title": "Skillet Chicken Parmesan Recipe",
    "description": "Good old-fashioned chicken Parmesan gets the skillet treatment in this one-pot dish. Serve with rice or spaghetti for comfort food at its finest—and fastest!",
    "prepTime": "10 minutes",
    "cookTime": "30 minutes",
    "yeild": "4 servings",
    "ingredients": "\n1 teaspoon salt\n1 teaspoon black pepper\n1 cup all-purpose flour\n1 large egg\n1 cup Italian breadcrumbs\n1/2 cup grated Parmesan cheese\n1 1/2 to 2 pounds chicken cutlets\n1 cup olive oil\n1/2 cup diced onion\n2 cloves garlic, sliced\n2 cups marinara tomato sauce, homemade or store-bought\n6 ounces mozzarella cheese, sliced\nFresh basil, garnish\nRed pepper flakes, garnish\nCooked spaghetti or rice, for serving\n12-inch oven-safe cast iron or stainless steel skillet",
    "directions": "1 Preheat oven to 400°F. Heat olive oil in a 12-inch oven-safe skillet over medium heat. \n2 Bread the chicken: Prepare your breading stations by stirring the salt and pepper with the flour in one bowl, whisking the egg in a second bowl, and measuring breadcrumbs and Parmesan cheese into a third bowl. Coat chicken cutlets with seasoned flour. Dust off any extra flour.\nTransfer chicken cutlets to egg mixture and coat. Then transfer to the breadcrumbs and coat. Place breaded chicken on a plate.\n \n3 Fry the chicken: You'll know the oil is ready when a few breadcrumbs sizzle immediately when added to the oil (325°F). Add breaded chicken cutlets and fry for 4 minutes per side. The chicken should be 90 percent cooked through at this point; it should not be 100 percent cooked through. (Just a note though: You may need to fry in batches; if the pan gets overcrowded the chicken may not crisp up to your liking.)\nRemove chicken from the skillet, and carefully pour the olive oil into a bowl to cool, leaving about a tablespoon in the skillet. Don’t rinse out the skillet.\n\n4 Make the sauce: Add the onion and garlic to skillet and cook over medium-low heat for 2 minutes, until onion is translucent. Add the marinara sauce and bring to a low simmer.\n5 Finish the chicken Parm: Add the chicken back to the skillet in the sauce. Top each chicken piece with a slice of mozzarella cheese.\nPlace the skillet in the oven and bake for 10 to 12 minutes until the sauce is bubbling, the cheese is melted, and the chicken registers 165°F in the thickest parts.\n\n6 Serve: Serve chicken Parmesan immediately over pasta, rice, or even with bread and a salad. Garnish with red pepper flakes and fresh basil.\n\nLEFTOVERS! Leftover chicken Parmesan can be stored in the fridge for 4 to 5 days once it has cooled. For best results, reheat chicken Parm in a 325° F oven with some of the sauce until the cheese is re-melted.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/03/Skillet-Chicken-Parmesan-LEAD-7.jpg"
  },
  {
    "title": "Chicken Curry with Sweet Potato and Lemongrass Recipe",
    "description": "Chicken, lemongrass, and sweet potatoes on their own are pretty great, but when simmered in coconut milk and topped with chopped cilantro, they become pure magic in this Vietnamese Curry. ",
    "prepTime": "15 minutes",
    "cookTime": "40 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1/2 cup coarsely chopped lemongrass, from 2 medium stalks\n2 tablespoons coarsely chopped peeled ginger\n1 medium yellow onion, coarsely chopped\n2 tablespoons Madras-style curry powder, preferably Sun brand\n1/2 teaspoon freshly ground black pepper\n1/4 teaspoon cayenne pepper, optional\n1 (13.5-ounce) can full-fat, unsweetened coconut milk, not shaken\n2 tablespoons virgin coconut oil or neutral oil, such as canola\n4 large boneless, skinless chicken thighs (about 1 3/4 pounds total), each cut into 3 pieces\n1/2 teaspoon fine sea salt\n1 1/4 pounds sweet potatoes (white or orange flesh), peeled and cut into 1-inch chunks\n3 to 5 fresh cilantro sprigs, coarsely chopped\n",
    "directions": "1 Make the curry paste: In a food processor, whirl the lemongrass into a fine texture, about 3 minutes, pausing occasionally to scrape down the bowl. Add the ginger and pulse to finely chop. Add the onion and pulse again to chop.\nAdd the curry powder, black pepper, and cayenne (if using) and whirl until you have a fragrant yellow paste, about 30 seconds.\n\n2 Prep the coconut milk: Do not shake the can of coconut milk. Open the can and remove 1/3 cup of the thick cream at the top of the coconut milk. Stir the remaining lighter milk, and set both aside.\n\n3 Begin cooking the curry: In a 3- to 4-quart pot over medium-high heat, melt the coconut oil. Add the lemongrass paste and cook for 3 to 5 minutes, stirring frequently, until fragrant and no longer raw and harsh smelling. Lower the heat as needed to avoid scorching.\nAdd the chicken and 1/2 teaspoon salt, stir to combine, and cook for 1 minute to meld the flavors. Add the coconut milk and a little water to cover the chicken. Bring to a simmer over medium-high heat, cover, and adjust the heat to gently simmer for 15 minutes, stirring occasionally.\n \n4 Add the sweet potatoes: Uncover the pot, add the sweet potatoes, and return the curry to a simmer. Continue cooking for 10 to 12 minutes, uncovered and stirring occasionally, until the potatoes are tender.\n\n5 Finish the curry: Turn off the heat, stir the coconut cream into the sauce, and let rest on the burner’s receding heat for 10 minutes, uncovered, to blend and mature flavors. Taste and season with salt (unsalted curry powder may require an additional teaspoon), and splash in a bit of water if the flavors are too strong.\nServe immediately, garnished with the cilantro.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/03/chicken_lemongrass_curry_HERO00001_V2.jpg"
  },
  {
    "title": "Chinese 5-Spice Skillet Chicken with Green Beans and Peppers Recipe",
    "description": "Need dinner in a hurry? Chinese 5-Spice Skillet Dinner to the rescue! Lean protein, loads of colorful vegetables, and on the table in about 30 minutes!",
    "prepTime": "17 minutes",
    "cookTime": "32 minutes",
    "yeild": "4 to 6 Servings",
    "ingredients": "\n1 1/2 pounds boneless, skinless chicken tenders, tenderloin, or thinly sliced chicken breasts\n1 teaspoon fennel seeds\n1 teaspoon whole black peppercorns\n1 bay leaf\n1 teaspoon kosher salt\n1/2 tablespoon brown sugar, packed\n1 teaspoon Chinese 5-spice blend\nZest from 1 orange\n3 tablespoons orange juice\n2 teaspoons sesame oil\n\n1 pound fresh green beans, washed and trimmed\n1 large orange bell pepper\n1/2 large onion\n2 teaspoons soy sauce\n3 or 4 cracks of freshly ground pepper\nOrange zest for garnish (optional)\n",
    "directions": "1 Grind the spices: In a spice grinder, combine the fennel seeds, whole peppercorns, and 1 bay leaf. Run the grinder until the spices are finely ground.\n \n2 Label the bag: If you are planning to freeze your meal for later, use a Sharpie to write the title of the recipe on a gallon-sized zip top bag so you can easily find it on SimplyRecipes.com when you want to cook it. Alternatively, write the cooking instructions on the bag, and date it.\n\n3 Combine the ingredients: Roll down the opening of the bag a little, just so you don’t accidentally get raw chicken juices on the outside or the zip top. Add the chicken, spices, orange juice, and sesame oil.\nRemove as much air as possible, and seal the bag. Smoosh the chicken around so it’s coated in the marinade.\n\n4 Lay the chicken flat in the freezer and freeze for up to 6 months.\nAlternatively, you could skip the freezer and let it marinade in the fridge for a couple of hours, or up to two days, and then cook it according to the directions below.\n \n5 Thaw the chicken before cooking: When ready to cook, take the chicken out of the freezer in the morning before you go to work, and it will be ready to cook by the end of the day.\n6 To prepare the vegetables: Trim the beans, slice the pepper into 1-inch strips, and dice the onion.\n\n7 Cook the chicken and vegetables: Set a large skillet over medium heat. Add the chicken and any marinade left in the bag. If any chicken is folded up, unfold it so it lays flat in the pan.\nAfter 2 minutes, flip the chicken, and add the green beans, sliced pepper, onion, and 3 tablespoons of water. Cover and cook for 10 more minutes.\nLift the lid and check the chicken by slicing open a piece. If the juices run clear, the chicken is done. Remove the chicken from the pan to a plate (leaving the vegetables in the pan) and tent with foil to keep warm.\n\n8 Finish cooking the vegetables: Add soy sauce and a few cracks of freshly ground pepper to the vegetables. Gently stir the vegetables.\nCover and cook until the peppers are tender, and the beans are bright green but firm tender, about 5 more minutes.\n9 Serve: Nestle the chicken back into the pan and garnish with additional orange zest if you have it. Bring the skillet to the table and serve.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Skillet-Chicken-5spice-LEAD-2.jpg"
  },
  {
    "title": "Easy Chicken Lo Mein Recipe",
    "description": "Making chicken lo mein at home means you can clear the fridge of whatever veggies you've got on hand, and have dinner ready faster than it would take to call for takeout. Win! ",
    "prepTime": "15 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 servings ",
    "ingredients": "\n8 ounces cremini mushrooms, quartered\n1/2 red pepper, sliced\n1 tablespoon sesame oil\n1 to 2 teaspoons sriracha hot sauce\n\n3 tablespoons soy sauce\n1 tablespoon hoisin sauce\n2 teaspoons sesame oil\n2 tablespoons hot water\n\n8 ounces lo mein noodles, fresh or dried\n1 teaspoon sesame oil\n1 tablespoon vegetable oil\n1 pound boneless chicken breast, sliced thin\n1/2 head green cabbage, shredded (about 3 cups)\n1 large carrot, grated\n\nFresh scallions, chopped\nSesame seeds\nWok or large skillet",
    "directions": "1 If making the Sriracha Roasted Vegetables: Heat the oven to 400°F. In a small bowl, toss quartered mushrooms and red peppers with the sesame oil and sriracha. Spread out on a baking sheet.\nWhile you make the Chicken Lo Mein, bake for 15 minutes until tender and blistered in spots.\n\n2 Stir the sauce ingredients together and set near the stove.\n3 Cook the lo mein noodles: Bring a large amount of salted water to a boil. Add the noodles and cook until tender, usually around 4 minutes, but check the package directions for the noodles you are using.\nDrain the noodles and toss with sesame oil to prevent sticking.\n\n4 Cook the chicken: Heat a wok or large skillet over medium-high heat. Once hot, add the vegetable oil once that's hot, add the chicken. Cook until the chicken is cooked through, 5 to 6 minutes, stirring frequently.\n5 Add the vegetables: When chicken is cooked, add cabbage and carrots, and continue to stir and cook until the veggies wilt and the liquid they release is mostly evaporated, 2 to 3 minutes.\n\n6 Add the noodles and sauce: Add noodles along with sauce and stir with the chicken and veggies to combine. The sauce should coat the noodles and other ingredients. If the dish seems too dry, add more water.\nTaste and adjust the flavor to your liking. It might need another dash of soy sauce, for example.\n\n7 Serve: Serve the Chicken Lo Mein topped with scallions, sesame seeds, and roasted veggies (optional).\nLeftovers can be stored in the fridge for 3 to 4 days and will reheat beautifully in the microwave.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/EYF-Chicken-LoMein-LEAD-4.jpg"
  },
  {
    "title": "Char Siu Chicken Recipe",
    "description": "Warning: This Char Siu Chicken is highly addictive! You'll wonder how you ever grilled chicken thighs without this mix of honey, hoisin, garlic, soy sauce, and Chinese five-spice powder. It's a take-out staple that's easy to make at home!",
    "prepTime": "5 minutes",
    "cookTime": "30 minutes",
    "yeild": "4 servings",
    "ingredients": "\n1 large garlic clove, put through a garlic press or minced and mashed\n1/4 teaspoon Chinese five-spice powder\n2 tablespoons honey, preferably amber colored\nBrimming 2 tablespoons hoisin sauce\n1 1/2 tablespoons soy sauce\n1 tablespoon ketchup\nScant 2 teaspoons toasted sesame oil\n1 3/4 pounds boneless, skinless chicken thighs (See Recipe Note)\nCast iron grill pan or grill",
    "directions": "1 Marinate the chicken: In a large bowl, stir together the garlic, five-spice powder, honey, hoisin, soy sauce, ketchup, and sesame oil. Remove 3 tablespoons and set aside for glazing the chicken.\nAdd the chicken to the bowl, coating the pieces well. Cover with plastic wrap and marinate at room temperature for 30 minutes, or refrigerate up to 24 hours (return to room temperature before cooking).\n \n2 Grill the chicken: Lightly oil a cast-iron stovetop grill pan and set over medium-high heat. Add the chicken and cook for 6 to 10 minutes, turning several times.\nTo test for doneness, pierce the flesh with the tip of a knife: The chicken is cooked when clear juices flow out.\nDuring the last 2 minutes of cooking, when the chicken feels firm-ish, baste with the reserved marinade to freshen flavor and add sheen.\nAlternatively, prepare a medium charcoal fire or preheat a gas grill to medium and cook the chicken for 10 to 12 minutes, basting during the last 3 minutes.\n\n3 Serve: Transfer to a platter and let rest for 5 to 10 minutes before serving.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/char_siu_chicken_LEAD-VERTICAL.jpg"
  },
  {
    "title": "Chicken and Dumplings Recipe",
    "description": "Here's how to make classic chicken and dumplings! Start with a hearty chicken and vegetable stew, then adding delicious homemade dumplings. Learn the trick to light and fluffy homemade dumplings that still hold together.",
    "prepTime": "15 minutes",
    "cookTime": "45 minutes",
    "yeild": "6 to 8 Servings",
    "ingredients": "\n3 to 3  1/2 pounds chicken thighs and breast parts, skin-on, bone-in, trimmed of excess fat\n2 teaspoons butter or olive oil, or a combination of both\nSalt\n1 quart chicken stock (homemade is best)\n2 to 3 celery stalks, trimmed and cut into 1/2-inch pieces (about 2 cups)\n3 medium carrots, peeled and cut into 1/2-inch pieces (about 2 cups)\n1 large onion, roughly chopped (about 2 cups)\n1/3 cup all-purpose flour\n1 teaspoon dried thyme\n1/4 cup dry sherry or vermouth (optional)\n1 Tbsp heavy cream (optional)\n3/4 cup frozen peas, thawed\n1/4 cup minced fresh parsley leaves\nGround black or white pepper\n\n2 cups (250 g) cake flour (can sub all-purpose flour, but use cake flour if you have it, your dumplings will be fluffier)\n2 teaspoons baking powder\n3/4 teaspoon salt\n2 Tbsp butter, melted\n3/4 cup milk\n1/4 cup minced fresh herb leaves such as parsley, chives, and tarragon (optional)\n",
    "directions": "1 Heat the chicken stock to a gentle simmer in a medium pot.\n2 Brown the chicken: In a large 8-quart or larger thick-bottomed pot, heat the butter or olive oil over medium-high heat. Pat dry the chicken pieces and sprinkle with salt.\nWorking in batches, brown the chicken pieces, placing the pieces skin-side down first; this will render out fat you will use to build the stew later.\n \n3 Poach the chicken in the stock: Once the chicken pieces are browned on all sides, remove them from the large pot, and turn off the heat. Remove and discard the skin from the chicken pieces and put the chicken pieces into the pot of simmering stock.\nPoach the chicken in the stock until cooked through, about 20 minutes or so.\nRemove the chicken pieces and set on a tray to cool for a few minutes. When the chicken pieces are cool to touch, pull the meat off the bones and cut into 2-inch chunks. Set aside.\n4 Cook the vegetables until softened: Return the heat on the large pot to medium-high. When the pot is hot, add the onion, celery, carrot and thyme and sauté until soft, but not browned, about 4 to 5 minutes.\n\n5 Add the flour and stir well. The flour will absorb the fat in the pot and will stick a little to the bottom. Reduce the heat to medium-low and stir the flour vegetable mixture constantly for 2 to 3 minutes. Do not let it burn.\n \n6 Add sherry, slowly add stock: Get a ladle ready and have the pot of simmering chicken stock nearby. Add the sherry to the flour vegetable mixture. It will sputter and seize up.\nAdd a ladle of hot chicken stock to and stir well. It will be goopy. Add another ladle, then another, stirring all the while, until the broth comes together.\n\nAdd the rest of the chicken stock and the reserved chicken meat. Increase the heat and bring to a simmer, then reduce the heat to maintain a gentle simmer while you make the dumplings.\n7 Make the dumpling batter: Whisk together flour, baking powder, and salt in a medium bowl. Add (optional) chopped fresh herbs. Add melted butter and milk to the dry ingredients.\nGently mix with a wooden spoon until mixture just comes together. (Note: do not over-mix or your dumplings will turn out too dense.)\n \n8 Add dumplings to the stew: Drop dumpling batter into the simmering stew by heaping teaspoonfuls, over the surface of the stew. (Note that the dumplings will easily double in size as they cook.) Cover and simmer until dumplings are cooked through, about 15 minutes.\n \nOnce you have covered the pan, do not uncover and peek while the dumplings are cooking! In order for the dumplings to be light and fluffy, they must steam, not boil. Uncovering the pan releases the steam.\nIf after 15 minutes the dumplings are still not cooked through (use a toothpick or skewer to test), then cover pan again and cook for another 5 to 10 minutes.\n9 Finish the stew: Gently stir in peas, parsley, and cream, if using. Add more salt to taste. Ladle portions of meat, sauce, vegetables, and dumplings into soup plates and serve. Note that the stew will continue to thicken the longer it sits.\n \n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2008/12/chicken-dumplings-a-vertical-1700.jpg"
  },
  {
    "title": "Sheet Pan Chicken Fajitas with Peppers and Onions Recipe",
    "description": "Chicken fajitas are made even simpler and easier with this sheet pan recipe! A quick marinade makes the chicken tasty and tender. Serve it right from the pan for an easy Tex-Mex family favorite. ",
    "prepTime": "15 minutes",
    "cookTime": "30 minutes",
    "yeild": "4 servings",
    "ingredients": "\n1/4 cup freshly squeezed lime juice (from 1 to 2 limes)\n1/4 cup freshly squeezed orange juice (from 1 small orange)\n2 tablespoons pickling juice, from a jar of pickled jalapeños (optional)\n1 tablespoon ancho chili powder (or chili powder blend)\n2 teaspoons dried oregano\n1 teaspoon ground cumin\n3/4 teaspoon salt\n3 tablespoons olive oil\n\n1 large red or yellow onion, cut into 1/4-inch thick slices\n2 large sweet bell peppers (red, yellow or green, or a combination), cut into 1/4-inch thick slices\n2 skinless, boneless chicken breast halves (about 1 1/4 pounds), cut into 1-inch strips\n8 to 12 corn tortillas\n\n1 avocado, sliced\nHandful of fresh cilantro leaves\n1 lime, quartered\nCooked rice and/or beans\nA rimmed baking sheet",
    "directions": "1 Preheat the oven to 450ºF. Lightly oil a rimmed baking sheet.\n2 Make the marinade: In a medium bowl, whisk together the lime juice, orange juice, pickling juice, chili powder, oregano, cumin, and salt. Whisk in the olive oil. Pour half of the marinade into a separate bowl or cup, and set aside.\n3 Marinate the chicken: Add the chicken to the bowl with the marinade. Toss to coat, and set aside to marinate while the peppers and onions are roasting (about 15 minutes).\n4 Cook the peppers and onions: In the center of a sheet pan, mound the onions and peppers. Drizzle the reserved half of the marinade over them and toss to coat.\nSpread them in one layer and roast for about 15 minutes, or until they begin to soften.\n\n5 Cook the chicken with the peppers and onions: Add the chicken strips to the pan with the softened vegetables, distributing them among the peppers and onions. Drizzle any excess marinade over the pan.\nBake for 15 minutes, or until the chicken is cooked through (at least 165ºF when measured with an instant read thermometer).\n6 Broil the chicken and vegetables to char them: Set a rack 3 to 4 inches from the broiler and turn on the broiler. Broil for 2 to 3 minutes, or until the chicken and vegetables are lightly charred.\n\n7 Warm the tortillas: Set a dry skillet over medium heat and heat until hot. Lay one tortilla at a time on the hot pan and turn, as above. Use 2 pans or a pancake griddle if you want to heat more than one at time.\nAlternately, you can place a tortilla (one at a time) directly over a gas burner on medium-low heat for about 20 seconds, or until it starts to puff slightly. With tongs, turn it over and let it heat for a few more seconds on the other side.\nThe microwave also works. Just wrap 1 to 3 tortillas in a damp paper towel and microwave for 30 seconds, or until hot.\nWrap the warm tortillas in a napkin and set them on a plate.\n8 Serve the fajitas: Transfer the chicken and vegetables to a warm platter. Bring the platter and the warm tortillas to the table for people to help themselves. Serve with lime wedges, cilantro, and avocado. If you like, you could serve with rice and beans, too.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Sheet-Pan-Chicken-LEAD-6.jpg"
  },
  {
    "title": "Southwest Skillet Chicken with Beans and Corn Recipe",
    "description": "Need something quick and delicious for dinner? This Southwest Skillet Chicken is easy, freezer-friendly, and ready in 35 minutes. Make it with beans, corn, and bell peppers!",
    "prepTime": "15 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 1/2 pounds boneless skinless chicken tenders, tenderloin, or thinly sliced chicken breasts\n1 1/4 teaspoon kosher salt\n1 teaspoon ground cumin\n3/4 teaspoon chili powder\n1/2 teaspoon freshly ground black pepper\n1/2 tablespoon granulated sugar\n1/2 teaspoon ground coriander\n1/2 teaspoon smoked paprika\nZest from 2 limes\n1 1/2 tablespoons lime juice, from about half a lime\n2 cloves garlic, minced\n2 tablespoons vegetable oil\n\n2 teaspoons vegetable oil\n1 medium green pepper\n1 medium red pepper\n1/2 medium yellow onion\n1 cup frozen corn\n1 (15 oz) can black beans, drained and rinsed\nCilantro for garnish (optional)\nCooked rice or tortillas, to serve\n",
    "directions": "1 Label the bag: Use a sharpie to write the date and title of the recipe on a gallon-sized zip top bag so you can easily find it on SimplyRecipes.com when you want to cook it. Alternatively, write the cooking instructions on the bag, and date it.\n\n2 Combine the ingredients: Roll down the opening of the bag a little just so you don’t accidentally get raw chicken juices on the outside or the zip top. Add the chicken, spices, zest, lime juice, garlic, and vegetable oil.\nRemove as much air as possible and seal the bag. Smoosh the chicken around so it’s coated in the marinade.\n\n3 Lay the chicken flat in the freezer and freeze for up to 6 months:\nAlternatively, you could skip the freezer and let it marinade in the fridge for a couple of hours and up to two days, then cook it according to the directions below.\n\n 4 Thaw the chicken before cooking: When ready to cook, take the chicken out of the freezer in the morning before you go to work, and it will be ready to cook by the end of the day.\n5 Prepare the vegetables: Dice the peppers, dice the onion, measure the corn, and drain and rinse the beans.\n\n6 Cook the chicken: Set a large skillet over medium heat add 2 teaspoons of vegetable oil. Once the oil shimmers, add the chicken and any marinade from the bag. If any chicken is folded up, unfold it so it lays flat in the pan. Cook the chicken for 5 minutes, then flip it.\n \n7 Add the vegetables: Add onions, corn, and peppers. Cover with a lid. Let everything simmer together for about 5 minutes.\nLift the lid and stir the meat and vegetables together. Cook uncovered for another 5 minutes.\nAdd the beans and cook for another 3 minutes until the beans warm through. The meat is cooked when you slice open a breast and the juices run clear.\n\n8 To serve: Put a chicken breast on each plate and top with vegetables. Spoon pan sauces over chicken. Season to taste with salt and pepper. Garnish with minced cilantro and serve with tortillas or rice.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Skillet-Chicken-Paprika-LEAD-2.jpg"
  },
  {
    "title": "Chicken Pot Pie Recipe",
    "description": "Here's a from-scratch Chicken Pot Pie adapted from Marshall Field's classic recipe. With a slow-cooked chicken, a creamy vegetable filling, and a handmade pie crust, this pot pie is the ultimate comfort food.",
    "prepTime": "1 hour, 30 minutes",
    "cookTime": "25 minutes",
    "yeild": "6 Servings",
    "ingredients": "\n1 (3 1/2 pound) whole chicken\n1 carrot\n1 celery stalk\n1 small onion, halved\n2 teaspoons salt\n\n1 1/2 cups all-purpose flour\n1/2 teaspoon salt\n1/2 cup (1 stick) chilled unsalted butter, diced into 1/2-inch cubes (best to chill cubes in the freezer for at least 15 minutes before using)\n1/4 cup vegetable shortening, chilled\n3 to 4 Tbsp ice water\n\n6 Tbsp unsalted butter\n1 large onion, diced (about 1 1/4 cups)\n3 carrots, thinly sliced on the diagonal\n3 celery stalks, thinly sliced on the diagonal\n1/2 cup all-purpose flour\n1 1/2 cups milk\n1 teaspoon chopped fresh thyme leaves\n1/4 cup dry sherry\n3/4 cup green peas, frozen or fresh\n2 Tbsp minced fresh parsley\n2 teaspoons salt\n1/2 teaspoon freshly ground black pepper\n\n1 egg whisked with 1 Tbsp water\n6 10-ounce ramekins",
    "directions": "1 Cook the chicken and make the chicken stock: Combine the chicken, carrot, celery, onion and salt into a large stock pot. Add cold water until just covered and bring to a boil over high heat.\n\nReduce the heat to a simmer and cook for 45 minutes. Remove the chicken from the pot and let cool for 15 minutes.\nWhile the chicken is cooling, continue to boil the remaining water and vegetables in the pot.\nWhen the chicken has cooled enough to touch, strip away as much of the meat as you can. Place the meat on a dish, set aside.\n\nReturn the chicken bones to the stockpot and continue to boil, on high heat, until the stock has reduced to a quart or quart and a half.\nSet aside 2 1/2 cups of the stock for this recipe. The remaining stock you can refrigerate and store for another purpose.\n2 Prepare the pie crust dough: Combine the flour and salt in a food processor. Add the chilled butter cubes and pulse 5 times to combine. Add the shortening and pulse a few more times, until the dough resembles a coarse cornmeal, with some pea-sized pieces of butter.\n \nSlowly stream in ice water, a tablespoon at a time, pulsing after each addition, until the dough sticks together when you press some between your fingers.\nEmpty the food processor, placing the dough on a clean surface. Use your hands to mold into a ball, then flatten the ball into a disk.\n \nSprinkle with a little flour, wrap with plastic wrap, and refrigerate for at least 30 minutes, or up to 2 days, before rolling.\n3 Preheat oven to 400°F.\n4 Prepare the filling:  In a large skillet, melt butter on medium heat. Add the onions, carrots, and celery, and cook until the onions are translucent, about 10 minutes.\n\nAdd the flour and cook, stirring, one minute more.\nWhisk in 2 1/2 cups of the chicken stock. Whisk in the milk. Decrease the heat to low and simmer for 10 minutes, stirring often until thickened and creamy.\n\nAdd the chicken meat, thyme, sherry, peas, parsley, salt and pepper and stir well. Taste and adjust seasoning if necessary. Divide the warm filling among six 10-ounce ramekins.\n \n4 Prepare the crust: Roll out dough on a lightly flour surface to a little less than a quarter-inch thick.\nCut into 6 rounds, slightly larger than the circumference of the ramekins. Lay a dough round on each pot pie filling.\nFold the excess dough under itself and use the tines of a fork to press the dough against the edge of the ramekins.\n\nCut a 1-inch vent into each individual pie. Use a pastry brush to apply an egg wash to each pie.\n5 Bake: Line a baking sheet with foil, place the pies on the baking sheet. Bake at 400°F for 25 minutes, or until the pastry is golden and the filling is bubbling.\nLet cool for at least 5 minutes before serving.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/10/chicken-pot-pie-vertical-a-1200.jpg"
  },
  {
    "title": "Goldfish Chicken Tenders Recipe",
    "description": "Goldfish Chicken Tenders are the ultimate kid-friendly snack that meets the ultimate kid-friendly dinner! These tenders are baked in the oven to crispy perfection. But guess what? Adults love them, too. ",
    "prepTime": "15 minutes",
    "cookTime": "20 minutes",
    "yeild": "2 to 3 servings",
    "ingredients": "\nNonstick spray, for sheet pan\n2 cups Goldfish cheese crackers, well crushed\n1 cup all-purpose flour\n1 teaspoon salt\n1 teaspoon black pepper\n3 large eggs\n2 pounds chicken breast, sliced into strips about 2-inches long and 1/2-inch thick\n\n1 6-inch sub roll\n1 tablespoon mayonnaise\n1/2 cup shredded iceberg lettuce\n3 to 4 Goldfish chicken tenders\nPickled banana peppers\n",
    "directions": "1 Preheat the oven to 350°F. Line a baking sheet with foil and spray with nonstick spray (or brush with oil).\n2 Crush the crackers: Place the crackers in a zip-top plastic bag and seal it. Using your hands, a rolling pin, a mallet, or the hands of your children, crush the Goldfish as much as you can, but don't turn them into flour. You want some inconsistencies in shape; it'll make for better texture.\n\n3 Prep the assembly line: Find three medium bowls. Stir together the flour, salt, and pepper in one. Whisk the eggs together in the second bowl. Add the crushed Goldfish crackers to the last one.\n4 Bread the chicken: Working with a few pieces of chicken at a time, add to seasoned flour and coat well. Then shake off any extra flour, move to the eggs and coat well, and finally add to crushed Goldfish. Press the Goldfish on so they really stick and form a good crust.\nTransfer coated chicken to the baking sheet. Repeat until all the chicken tenders are coated.\n\n5 Bake the chicken: Bake chicken tenders for about 20 minutes until they are cooked through, or reach an internal temperature of 165°F in the thickest part of the tenders. You can also test one of the thicker ones by cutting it in half and making sure it’s cooked through.\nThere’s no need to flip these, but you can flip them halfway through if they are browning too much on one side.\nServe tenders while warm with a veggie and/or side salad and any dips you want, such as ketchup or bbq sauce. My kids loved honey! You can also make the Dad Add and have a sandwich!\n\nHow to Reheat Leftover Tenders\nYou will probably have leftovers, which will keep for 3 to 4 days in the fridge. They reheat perfectly, but they will get soggy if you reheat them in the microwave. Either reheat them gently in a nonstick skillet over low heat until warmed through, or put them on a baking sheet and reheat them until they’re crispy, 7 to 8 minutes.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Goldfish_Chicken_Tenders_HERO00004.jpg"
  },
  {
    "title": "Weeknight Chicken Ramen Recipe",
    "description": "A warm bowl of ramen need not be a big ordeal of time or fuss, as this weeknight chicken ramen attests. Boost store-bought chicken broth with some flavor enhancers and assemble your bowls in under 30 minutes.",
    "prepTime": "15 minutes",
    "cookTime": "15 minutes",
    "yeild": "4 servings",
    "ingredients": "\n2 tablespoons toasted sesame oil\n4 scallions, thinly sliced, including some of the green part\n1 clove garlic, minced\n1 small carrot, peeled and thinly sliced\n4 ounces button, cremini, or shiitake mushrooms, thinly sliced\n1 1/2 cups thinly shredded Napa cabbage, spinach, kale, or other greens\n1-inch piece fresh ginger, minced\n6 cups low-sodium chicken broth, store-bought or homemade\n1 tablespoon brown sugar, optional\nLime wedges, optional\n\n4 large eggs\n20 ounces fresh ramen noodles, or 12 ounces dried noodles\n2 medium cooked chicken breast halves, sliced\n\nSoy sauce\nSriracha or other hot sauce\nHandful fresh cilantro, leaves removed from stems\nLime wedges\n",
    "directions": "1 Make the broth: In a large saucepan over medium heat, heat the oil. Add the scallions, garlic, carrot, mushrooms, and cabbage. Cook, stirring often, for 3 minutes, or until the vegetables soften.\nStir in the ginger and brown sugar and cook for 30 seconds. Finally add the chicken broth and bring to a simmer. Simmer for 10 minutes.\n \n2 Cook the eggs: While the broth is simmering, bring a pot of water to a boil. Set a bowl of cold ice water nearby.\nUse a slotted spoon to gently lower the eggs, still in the shell, into the water. Simmer for 7 minutes for eggs that are soft and a little runny in the center, or 9 minutes for hard-boiled eggs.\nTransfer the eggs to the bowl of cold water and set aside until ready to serve.\n3 Cook the noodles: Return the pot of water to a boil. Add the noodles and cook for 3 minutes, or according to the package directions, until tender. Drain in a colander.\n\n4 Assemble the soup: Divide the noodles among 4 large bowls. Ladle the broth and vegetables over the noodles.\nRemove the eggs from the ice water. Tap the shells with a spoon to crack and then peel off the shells. Pat the eggs dry and cut them in half.\nTop each bowl with the egg halves and the sliced chicken. Serve with soy sauce, hot sauce, cilantro leaves and lime wedges.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/03/Weeknight-Chicken-Ramen-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Herbes de Provence Skillet Chicken with Potatoes and Greens Recipe",
    "description": "One pan? Yes, please! This French Herbes de Provence skillet chicken uses chicken tenders, potatoes, olives, and spinach make quick work for this weeknight, freezer friendly meal.",
    "prepTime": "15 minutes",
    "cookTime": "35 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 1/2 pounds boneless skinless chicken tenders, tenderloin, or thinly sliced chicken breasts\n1 1/2 tablespoons herbes de Provence\n1 1/4 teaspoons Kosher salt\n1 teaspoon freshly ground pepper\nZest of one lemon\n1 1/2 tablespoons lemon juice\n3 cloves minced garlic\n2 tablespoons olive oil\n\n2 teaspoons olive oil\n3 tablespoons butter, divided\n1 1/2 pounds B-sized or baby potatoes\n1/2 yellow onion\n1/2 teaspoon Kosher salt\nA few cracks of freshly ground pepper\n2 handfuls (2 packed cups) Swiss chard or spinach\n1/3 cup halved pimento-stuffed Spanish olives\n1 teaspoon red wine vinegar\n",
    "directions": "1 Label the bag: Use a sharpie to write the date and title of the recipe on a gallon-sized zip top bag so you can easily find it on SimplyRecipes.com when you want to cook it. Alternatively, write the cooking instructions on the bag, and date it.\n\n2 Combine the ingredients: Roll down the opening of the bag a little just so you don’t accidently get raw chicken juices on the outside of the zip top. Add the chicken, spices, zest, lemon juice, garlic and olive oil.\nRemove as much air as possible and seal the bag. Smoosh the chicken around so it’s coated in the marinade.\n\n3 Lay the chicken flat in the freezer and freeze for up to 6 months:\nAlternatively, you could skip the freezer and let it marinade in the fridge for a couple of hours and up to two days, then cook it according to the directions below.\n 4 Thaw the chicken before cooking: When ready to cook, take the chicken out of the freezer in the morning before you go to work, and it will be ready to cook by the end of the day.\n5 Prepare the vegetables: If the b-sized potatoes are larger than a golf ball, quarter them; if they are smaller just half them. Slice the onion. Wash the Swiss chard, remove the stems and chop them. Then cut the leaves into strips about an inch thick. Cut the olives in half.\n  \n6 Cook the chicken: Set a large skillet over medium heat add 2 teaspoons of olive oil and 1 tablespoon butter. Once the oil shimmers and the butter melts, add the chicken and any marinade in the bag.\nIf any chicken is folded up, unfold it so it lays flat in the pan. Cook the chicken for 2 minutes, then flip it.\n\n7 Add the vegetables: Add the potatoes, onion, and 1/4 cup water to the pan with the chicken. Cover with a lid. Let everything simmer together for about 10 minutes.\n\n8 Finish the potatoes and make the sauce: Remove the chicken to a plate (leaving the vegetables in the skillet) and tent with foil. Add the remaining 2 tablespoons of butter, 1/4 teaspoon of salt and a few cracks of freshly ground pepper to the skillet. Stir the potatoes, cover and cook for another 10 minutes.\nTurn the heat up to medium high to reduce the liquid and finish cooking the potatoes uncovered. This should take about 2 to 3 minutes depending on how much liquid is in the pan.\nWhen you can easily pierce the potatoes with a fork, add the chard leaves and chopped stems, olives, and red wine vinegar. Toss gently until the greens are just wilted.\n9 Serve: Nestle the chicken back into the pan. Bring the whole thing over to the table and serve.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Skillet-Chicken-Herbes-LEAD-3.jpg"
  },
  {
    "title": "BBQ Chicken Sheet Pan Pizza Recipe",
    "description": "What about BBQ chicken for your next pizza?! This recipe uses leftover cooked chicken and balances sweetness with heat with a hickory BBQ sauce. Press the dough into the pan, add the toppings, and you're good to go! ",
    "prepTime": "15 minutes",
    "cookTime": "15 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 pound pizza dough, store-bought or homemade, room temperature (See Recipe Note)\n2 tablespoons olive oil\n2 cups cooked shredded chicken\n1 cup BBQ sauce, such as Hunt's Hickory BBQ Sauce\n6 ounces (about 1 1/2 cups) shredded mozzarella cheese, divided\n1/2 red onion, thinly sliced\n1 jalapeño, thinly sliced\n",
    "directions": "1 Preheat the oven to 450ºF. Place a rack in the lowest position.\n2 Stretch the dough onto the baking sheet: Place the dough in the center of the baking sheet and drizzle with the oil. Turn the dough to coat it well, spreading some of the oil over the baking sheet.\nGradually stretch the dough until it reaches the edges of the baking sheet, being careful not to rip any holes in the dough. If it springs back or is difficult to stretch, this usually means that the dough is too cold. To remedy the situation, cover with plastic wrap and let rest for 10 minutes before continuing.\n\n3 Top the pizza: Mix together the shredded chicken and barbecue sauce in a bowl, then spread evenly over the pizza dough, leaving a little bit of a border around the pizza.\nSprinkle evenly with two-thirds of the cheese, scatter the red onion and then the jalapeño, and then sprinkle with the remaining cheese. (I like to have cheese both under and over the toppings, but you can assemble it however you choose.)\n\n4 Bake the pizza: Set the pan on lowest shelf of the oven and bake until the cheese melts and the pizza is golden brown, about 15 minutes. Cut into squares and serve hot.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/01/Sheet_Pan_BBQ_Pizza_HERO-VERTICAL1.jpg"
  },
  {
    "title": "Slow Cooker Jambalaya Recipe",
    "description": "This Slow Cooker Jambalaya is a great way to make this New Orleans favorite with less effort! It's loaded with shrimp, chicken, sausage, and Creole seasonings.",
    "prepTime": "20 minutes",
    "cookTime": "5 to 6 hours ",
    "yeild": "8 servings",
    "ingredients": "\n1 white onion, diced\n3 stalks celery, diced\n1 green bell pepper, diced\n3 cloves garlic, diced\n1 pound smoked sausage, sliced about 1/4 inch\n1 pound boneless chicken breasts and/or thighs, cut into bite-sized pieces\n1 (28-ounce) can diced tomatoes\n1 tablespoon dried oregano\n2 bay leaves\n1 to 2 tablespoons Creole seasoning (I like Tony Chachere’s Creole Seasoning)\n1 pound large shrimp, shell on\n1 cup long grain white rice\n1/2 teaspoon salt, or to taste\n1/2 teaspoon black pepper, or to taste\nFresh parsley, chopped, for garnish\n6-quart or larger slow cooker",
    "directions": "1 Slow cook the sausage, chicken, and veggies: Add the onion, celery, bell pepper, garlic, sausage, chicken, tomatoes, oregano, bay leaves, and Creole seasoning to a large slow cooker. Stir together well.\nCook on high for 3 hours or on low for 4 to 5 hours. You are ready to move onto the next step when the veggies are very tender and the chicken is cooked through and you can pull it easily apart.\n\n2 Add the shrimp and cook on high: Leave the shells on the shrimp, but use kitchen shears to cut up the backs; this will make them easier to peel later.\nAdd the shrimp to the slow cooker. Stir it in, cover, and cook on high for another 30 to 45 minutes until the shrimp are cooked through.\n3 Cook the rice: While the shrimp cooks, cook the rice either according to the package directions or following this boiled rice method. When done, set the rice aside, covered, until ready to serve. (This makes about 4 cups of cooked rice.)\n3 Taste and season: Remove bay leaves from the jambalaya and taste. Season with salt and pepper to taste and garnish with fresh chopped parsley. Either peel the shells off the shrimp now, or serve with the shells on and instruct guests to remove the shells as they eat.\nStir the cooked rice into the jambalaya (as pictured), or serve the jambalaya ladled over top the rice.\nLeftovers will keep in the fridge in air-tight containers for 2 to 3 days and then the shrimp start to really break down. This dish doesn’t freeze particularly well. The combination of rice, shrimp, and sauce doesn’t reheat easily without making the shrimp very rubbery.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Slow_Cooker_Jambalaya_HERO00004.jpg"
  },
  {
    "title": "Italian Skillet Chicken with Spinach, Tomatoes, and Onions Recipe",
    "description": "Break out your skillet tonight for this Italian-inspired chicken dish! Spinach, tomatoes, red onion, and capers combine to make this super simple meal a flavor superstar. Freezes well, too! ",
    "prepTime": "12 minutes",
    "cookTime": "25 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 1/2 pounds boneless skinless chicken tenders, tenderloin, or thinly sliced chicken breasts\n1 tablespoon dried oregano\n2 1/2 teaspoons dried thyme\n1 1/2 teaspoons Kosher salt\n1 teaspoon dried basil\n1 teaspoon freshly ground pepper\nZest from 1 lemon\n3 tablespoons lemon juice, from about 1 lemon\n3 cloves garlic, minced\n2 tablespoons olive oil\n\n2 teaspoons olive oil\n1 pint cherry tomatoes\n1 medium red onion\n2 large handfuls spinach, about 2 packed cups\n1 teaspoon capers\n1 tablespoon butter\nCrusty bread, to serve\n",
    "directions": "1 Label the bag: Use a sharpie to write the date and the title of the recipe on a gallon-sized zip top bag so you can easily find it on SimplyRecipes.com when you want to cook it. Alternatively, write the cooking instructions on the bag.\n\n2 Combine the ingredients: Roll down the opening of the bag a little just so you don’t accidently get raw chicken juices on the outside of the zip top. Add the chicken, spices, zest,  lemon juice, garlic and olive oil.\nRemove as much air as possible and seal the bag. Smoosh the chicken around so it’s coated in the marinade.\n \n3 Lay the chicken flat in the freezer and freeze for up to 6 months.\nAlternatively, you could skip the freezer and let it marinade in the fridge for a couple of hours and up to two days, then cook it according to the directions below.\n4 Thaw the chicken before cooking: Take the chicken out of the freezer in the morning before you go to work, and it will be ready to cook by the end of the day.\n5 Prepare the onion: Peel and trim the stem ends of the onion, but leave the stem intact so it can keep the onion layers together. Slice the onion in half. Then slice each half into 5 wedges leaving a little stem with each one.\n\n6 Cook the chicken: Set a large skillet over medium heat add 2 teaspoons of olive oil. Once the oil shimmers, add chicken and any marinade in the bag. If any chicken is folded up, unfolded it so it lays flat in the pan. Cook the chicken for 2 minutes, then flip it.\n\n7 Add the vegetables: Add the onion wedges, tomatoes, and capers. Cover with a lid. Let everything simmer together for 12 to 15 minutes. The tomatoes should be soft, and the onions dull in color.\n\n8 Check the chicken: Check the chicken to see if it’s cooked through by cutting a piece open. If the juices run clear, and you don’t see any pink the chicken is ready. Use a fork to remove the chicken to a plate and tent with foil.\n\n9 Finish the sauce: Turn the heat up to medium high. Add 1 tablespoon butter to the sauce. Stir it in and let the sauce reduce uncovered for about 2 minutes. Add the spinach stir to coat a couple of times until the spinach has wilted.\n\n10 To serve: Nestle the chicken back into the pan, and season to taste with salt and pepper.\nBring the skillet to the table. Spoon up chicken, vegetables and sauces into shallow bowls or plates. Serve with crusty bread to sop up the sauce.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/02/Skillet-Chicken-Italian-LEAD-3.jpg"
  },
  {
    "title": "Indian Chicken Biryani Recipe",
    "description": "Have you ever tried making Indian biryani at home? There's something magical that happens when you combine chicken, rice, a number of spices and you infuse it with cardamom pods, saffron, and top the whole thing with fried onions. ",
    "prepTime": "1 hour",
    "cookTime": "1 hour",
    "yeild": "4 to 6 servings",
    "ingredients": "\n2 teaspoons ginger garlic paste, divided\n1 teaspoon turmeric powder\n2 to 3 whole chilis, sliced (jalapeno, serrano or cayenne)\n1/4 cup plain whole milk yogurt\n1 teaspoon olive oil\n1 1/2 pounds bone-in chicken pieces (drumsticks or whole thighs)\n1 tablespoon ghee (clarified butter) or unsalted butter\n1/3 cup finely chopped red onion (about 1/4 of a large onion)\n\n2 cups long grain basmati rice\n3 to 4 whole black cardamom pods\n3 to 4 whole green cardamom pods\n2-inch cinnamon stick\n1 teaspoon whole peppercorns\n1 to 2 bay leaves\nSalt to taste\n\n1/2 teaspoon saffron threads\n1/3 cup milk, cold or room temperature\n\n1 cup cooking oil\n1 cup thinly sliced red onion (about 3/4 of a large onion)\n\n1 teaspoon ghee (clarified butter) or unsalted butter\n1/4 cup cilantro, coarsely chopped\n1/4 cup mint, coarsely chopped\n1/4 cup whole milk plain yogurt\n1 1/2 teaspoons garam masala\n2 to 3 tablespoons pomegranate arils (seeds)\n",
    "directions": "1 Marinate the chicken: Combine 1 teaspoon of the ginger garlic paste, turmeric, sliced chilis, yogurt, olive oil, and salt in a medium bowl. Add the chicken and massage well to coat with marinade.\nCover and pop in the refrigerator to marinate for at least 30 minutes or up to 1 hour.\n \n2 Prepare the rice: Wash rice in 2 to 3 batches of water. Drain and set aside.\nIn a large pot, add the salt, the whole spices, and lots of water. There should be enough water for the rice to float around freely when boiling (see How to Boil Rice). Bring it to a rolling boil.\nAdd the rice to the pot. Cook until the rice is 90 percent done and still slightly crunchy in the middle; the rice will finish cooking in the dish.\nDrain the rice through a sieve, then spread it on a baking sheet or a large plate to cool. Set aside for later. Do not discard whole spices in the rice.\n \n3 Make the saffron milk: Stir the saffron strands into the milk. Cover and set aside for 30 minutes or until ready to layer the biryani.\n\n4 Fry the onions: Heat the oil in a frying pan over high heat. Drop a strand of onion into the hot oil. If it sizzles loudly, then the oil is hot enough. The pan should be wide enough to accommodate all the onion slices without crowding. Set a plate lined with a paper towel nearby for draining the finished onions.\nCarefully drop the onions into hot oil (be careful as the oil might splatter). Cook for 2 to 3 minutes or until the onions are brown and crispy. It’s easy to overcook and burn the onion so keep a constant eye on the pan.\nCarefully remove all the onions with a slotted spoon or spider (that’s a ladle with a skimmer on it, like this one) and transfer to the paper-towel lined plate.\n\n5 Cook the chicken: Once the chicken has finished marinating, melt 1 tablespoon ghee in a medium-sized pot or pan on medium heat. Add the remaining 1 teaspoon of ginger garlic paste. Cook for a minute or until the paste begins to turn golden brown.\nAdd the finely chopped red onion. Cook for 3 to 5 minutes on medium heat until the onion softens and begins to turn golden.\nAdd marinated chicken and the marinade. Stir well. Cover and cook on medium-low heat for 8 to 10 minutes or until the chicken is about 90 percent cooked. The chicken will finish cooking in the oven after being layered with other components of the biryani.\n \n6 Preheat the oven to 350ºF.\n7 Assemble the biryani: Grease a 3-quart oval baking dish with 1 teaspoon ghee. Spread half of the rice in an even layer on the bottom of the baking dish. Press down gently with your hand to pack the rice layer.\nArrange the chicken and its sauce in a single layer on top of the rice, then top with the cilantro, mint, half of the fried onions, the yogurt, and 1/2 teaspoon garam masala.\nFollow with the rest of the rice. Press down again gently to pack everything. Spread the rest of the fried onion over the top and sprinkle with the remaining 1 teaspoon of garam masala. Evenly pour the saffron milk over everything.\n    \n8 Bake the biryani: Tightly cover the dish with 2 to 3 layers of aluminum foil. Place in the oven and bake for 40 to 50 minutes, or until the rice and rest of the ingredients are cooked through. The foil creates steam for the rice; just uncover a corner and check for doneness by pressing rice between your thumb and index finger.\n\n9 Rest the biryani: Transfer the biryani to a cooling rack and let it rest (covered) 10 to 15 minutes before uncovering the dish.\n\n10 Serve the biryani: Gently use a fork to mix all the layers together before serving with a side raita and/or a simple salad. Garnish with the pomegranate arils (seeds).\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/01/Chicken-Biryani-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Chicken Tortilla Soup Recipe",
    "description": "The BEST chicken tortilla soup! It's made with crispy fried strips of corn tortillas in a tomato-based Mexican soup with chicken stock, chiles, avocado, Jack cheese, cilantro and lime. Comfort food at its best.",
    "prepTime": "10 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 servings",
    "ingredients": "\n6 (6-inch) corn tortillas, preferably a little old and dried out\n1/4 cup peanut oil, canola oil, or extra virgin olive oil\n1/2 cup chopped onion\n2 cloves garlic, minced\n1 medium Anaheim, poblano or jalapeño chile, seeded, veins removed, chopped (Depending on the hotness and flavor desired. You can also mix chiles - 1 Anaheim and a half jalapeño.)\n4 cups chicken broth or homemade chicken stock\n1 can (14.5 oz) crushed tomatoes (preferably fire-roasted)\n1/2 teaspoon coarse salt (kosher or sea salt)\n1 1/2 cups shredded cooked chicken\n1 ripe avocado\n1/2 cup (2 oz) shredded Monterey Jack cheese (or mild cheddar)\nChopped fresh cilantro\n1 lime, cut into wedges\n",
    "directions": "1 Fry tortilla strips: If you are starting with somewhat old, dried out tortillas, great. If not and you are starting with relatively fresh tortillas, put them on a baking sheet and put them in the oven at 200°F for 10 to 15 minutes to dry them out a bit. It is best to start with tortillas that don't have a lot of moisture in them.\nCut the tortillas in half, and then cut the halves into 1/4-inch wide strips.\n\nHeat the oil over medium-high heat in a 3-quart pot. Working in three batches, fry the tortilla strips in the oil, until lightly browned and crisp. Remove the tortilla strips from the pan and let drain on a paper-towel-lined plate.\n\n2 Sauté onions, chile, garlic: Add the chopped onions to the pan, cook 2 minutes, stirring frequently. Add the chopped chile and cook for 2-3 minutes more, until the onions and chiles have softened. Add the garlic and cook for 30 seconds more.\n3 Add broth, tomatoes, salt, chicken: Add the broth, tomatoes, and salt. Increase the heat to high, heat until the soup begins to boil, then reduce the heat to a low simmer, cover and simmer for 15 minutes. Add the shredded chicken and cook until heated through.\n4 Serve with tortilla strips and garnishes: To serve, pit, peel, and cut the avocado into 1-inch pieces. Divide half of the tortilla strips among 4 individual serving bowls; ladle in soup. Top with avocado and cheese; garnish with remaining tortilla strips and cilantro. Serve with lime wedges.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/08/tortilla-soup-VERT2.jpg"
  },
  {
    "title": "Chicken Milanese Recipe",
    "description": "This classic Italian Chicken Milanese is surprisingly EASY and FAST to make at home. Serve it with a side salad for an easy weeknight meal. Also works as a make-ahead dish!",
    "prepTime": "30 minutes",
    "cookTime": "15 minutes",
    "yeild": "4 servings",
    "ingredients": "\n4 large skinless boneless chicken breasts (1 1/2 pounds, 680 g)\n1 1/2 cups (190 g) all-purpose flour\n1 teaspoon salt\n1/2 teaspoon ground pepper\n3 large eggs\n2 cups (144 g) Panko breadcrumbs\n8 tablespoons (120 ml) olive oil, or more if needed\n1 lemon, cut into wedges, for serving\n",
    "directions": "1 Prepare the chicken: Set aside any smaller breasts or cutlets that are 1/2-inch thick. Set larger breasts on a cutting board. Hold the top of the chicken steady with one hand and hold a sharp knife parallel to the table in the other hand, then butterfly the breast in half like opening a book (watch your fingers!). Cut all the way through to make two thin pieces.\nContinue with the remaining large breasts. Pat them dry with paper towels. Set them on a rimmed baking sheet.\n\n2 Pound the chicken: Set one of the chicken breast slices between 2 sheets of plastic wrap. Use a meat mallet or small heavy pan to pound the breast to flatten it – six or so good whacks should do it.  Continue with the remaining breasts, returning them to the baking sheet.\n\n2 Set up an assembly line for coating the chicken: In a pie pan or shallow bowl, place the flour, 1/2 teaspoon of the salt, and pepper. Stir thoroughly. In another pie pan or shallow bowl, beat the eggs with the remaining 1/2 teaspoon salt. In a third pie pan or bowl, place the Panko.\nSet the pan of chicken on the counter. Set the flour next to it on the right. Set the egg to the right, then the Panko as the last thing in the row.\n\n3 Coat the chicken: With tongs, dip one slice of chicken in flour, making sure both sides are coated and shaking the excess into the bowl. Next, coat the chicken in egg and lift it up so the excess falls back into the bowl. Finally, transfer to the Panko and coat both sides.\nReturn the chicken to the baking sheet. Continue with the remaining breasts until they are all coated.\n\n3 Cook the chicken in batches: Heat the oven to 250F with a baking sheet on a middle rack. Set a heavy 12-inch skillet over medium-high heat.\nAdd enough of the olive to the pan to make a 1/4-inch layer (about 4 tablespoons). Heat until the oil shimmers and flows; when hot, a piece of Panko thrown in the oil should sizzle.\nAdd 3 pieces of chicken in a single layer and cook without moving for 4 minutes, or until the bottoms are golden. Turn and brown the other sides for another 4 minutes, or until the chicken is cooked through.\n\n4 Keep the chicken warm: Transfer the finished chicken to the oven so they stay warm while you cook the remaining breasts. Cook the remaining breasts, adding more oil to the pan as needed to keep it coated.\n5 To serve: Serve right away with lemon and a green salad.\nIf making ahead, let the cooked chicken cool completely on a parchment-lined baking sheet, then store in the fridge. If you're planning on reheating in a few hours, you can leave them on the baking sheet. Otherwise, layer them in an airtight container with parchment between the layers, and refrigerate for 1 to 3 days.\nTo reheat, let the chicken cutlets sit out for half an hour to lose their chill, then warm in a 400F oven for 8 to 10 minutes or until piping hot and crispy.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/02/2017-03-28-ChickenMilanese-7.jpg"
  },
  {
    "title": "Lemon Chicken Recipe",
    "description": "This easy lemon chicken recipe is your ticket to an easy weeknight dinner! Not too lemony, just right. It's made with garlic, butter, lemon, thyme, and rosemary.",
    "prepTime": "10 minutes",
    "cookTime": "45 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n3 to 4 pounds chicken parts (thighs and legs recommended), skin-on, bone-in, trimmed of excess fat\n\n4 teaspoons lemon zest (about zest from 2 lemons)\n1/3 cup lemon juice\n2 cloves garlic, crushed\n2 Tbsp fresh chopped thyme (or 2 teaspoons dried)\n2 teaspoons fresh chopped rosemary (or 1/2 teaspoon dried)\n1 teaspoon Kosher salt\n1 teaspoon black pepper\n\n2 Tbsp melted butter\nLemon slices for garnish\n",
    "directions": "1 Marinate chicken: Place lemon juice, lemon zest, garlic, thyme, rosemary, salt, and pepper in a large, non-reactive bowl, whisk to combine.\nWith the tip of a sharp knife, cut into the underside (skinless) of each chicken piece one or two times by about 1/2 an inch. (This will help the marinade penetrate.)\nPlace the chicken pieces in the bowl and turn to coat with the marinade. Place in the refrigerator and marinate for 1 to 2 hours.\n\n2 Place chicken in baking dish, brush with butter: Preheat oven to 425°F. Remove chicken from marinade and place in a single layer in a large baking dish, skin side up. Reserve the marinade. Use a pastry brush to brush melted butter on each piece of chicken.\n\n3 Bake and baste with marinade: Bake for 20 minutes and baste the chicken pieces generously with the reserved marinade. Continue baking for another 15 to 25 minutes (a total of 35 to 45 minutes), until the skins are crispy brown, and the chicken is cooked through, juices running clear (internal temperature of 165°F).\nDepending on the size of the breasts, they may be ready before the thighs, so if you are cooking a mix of chicken parts, keep that in mind, you may have to take them out of the oven before the thighs.\n\n4 Let rest, covered in foil, for 10 minutes before serving.\n5 Save meat juices to serve with chicken: Pour the juices from the pan into a serving bowl. Use a tablespoon to skim the fat off the top (save the fat for cooking with later, or discard, but do not discard down the drain or it will solidify and clog your drain).\nServe the chicken with the juices on the side or a little poured over the top of the chicken.\nServe alone, or with steamed rice, buttered noodles, angel hair pasta, or mashed potatoes.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/03/lemon-chicken-vertical-a-1200-1.jpg"
  },
  {
    "title": "Salsa Verde Chicken Enchiladas Recipe",
    "description": "These chicken enchiladas are made with a tangy tomatillo salsa verde sauce! This is a fantastic recipe to serve a hungry crowd, whether it's Friday movie night, a pot-luck party, or just a weeknight dinner with your family.",
    "prepTime": "30 minutes",
    "cookTime": "10 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 1/3 pounds skinless chicken thighs, boneless or bone-in (1 3/4 lbs if bone-in)\n2 clove garlic, halved\n1/4 medium onion\n2 teaspoons sea salt\n\n1 1/2 lbs tomatillos, papery husks removed, rinsed\n2 serrano chile peppers, top cut off to expose interior and to remove stems\n2 cloves garlic\n1/2 cup chopped white or yellow onion\n1/2 cup chopped cilantro, stems included\n1 tablespoon fresh lime juice\n1 teaspoon sea salt\n\n1 tablespoon high smoke point cooking oil such as canola oil, peanut oil or rice bran oil\n12 corn tortillas (use sturdy yellow corn tortillas)\n1/4 cup sour cream\n1/2 cup crumbled Mexican Cotija or Queso Fresco cheese\n1/3 cup chopped red onion for garnish\n1/2 cup chopped fresh cilantro, including stems for garnish\n",
    "directions": "1 Poach chicken thighs: Put chicken thighs in a medium sized saucepan and just cover with water. Add the halved garlic, 1/4 of an onion, and 2 teaspoons of salt to the water.\nBring to a simmer, reduce the heat to very low to maintain the heat at just below a simmer, and cook, covered, for 10 to 15 minutes, or until the chicken is just barely cooked through. (Here are the step-by-step instructions for How to Poach Chicken.)\nRemove chicken thighs to a separate bowl and let cool enough to touch.\n2 Cook the tomatillos: While the chicken is cooking, put the tomatillos and serrano chile peppers in a separate sauce pan and cover them with water. Bring to a boil, reduce to a simmer. Simmer until the tomatillos are cooked, and have changed color, but are not mushy, about 5 minutes. Remove from heat.\n\n3 Make the salsa verde: Use a slotted spoon to transfer tomatillos and serrano chiles to a blender. Add 1/4 cup of the tomatillo cooking liquid to the blender, as well as 2 cloves of garlic, a half cup of chopped onion, 1 tablespoon of lime juice, and about 1/2 cup of chopped cilantro. Add one teaspoon of salt.\nPurée until blended, 15 to 30 seconds. Taste for heat. If not spicy enough add another chile pepper (it doesn't have to be cooked). Add more salt to taste if necessary.\nYou should have about 3 cups of salsa.\n4 Shred chicken meat, toss with salsa verde: Remove the cooked chicken meat from the bones (if using bone-in thighs).\nShred the meat with a fork or knife. Put the chicken in a bowl and add 1/2 cup of the tomatillo sauce to the chicken. Taste the chicken; if it needs salt, add a little.\n\n5 Soften the tortillas: Heat a tablespoon of oil in a frying pan on medium high heat. Add a tortilla to the pan and let it sizzle for 10 seconds or so. Use a metal spatula to flip it to the other side. Let it sizzle for a few seconds. Place another tortilla on top of this one (to soak up the excess oil) and flip again.\nYou can keep going, stacking corn tortillas on top of the tortillas that appear to have excess oil. This way the new tortillas absorb some of the excess fat from the other tortillas.\n \nWhen the tortillas are heated through, remove them to a plate lined with paper towel. Add a more oil to the pan as needed, and continue to heat through and soften all of the tortillas.\n\n6 Roll up tortillas with chicken: Preheat the oven to 250°F. Scoop a spoonful of chicken into the center of the tortilla and roll up the tortilla. Place the rolled tortilla seam side down in a casserole dish and repeat with all of the tortillas.\n \n7 Cover with foil and warm in oven: Cover the rolled tortillas with foil and keep warm in a 250°F for 10 minutes.\n8 Heat salsa and smother the rolled tortillas with it: Place the remaining tomatillo salsa in a small saucepan and heat on medium high heat until simmering. Remove warmed rolled tortillas from the oven and smother with the salsa.\nLet some of the sauce go between the rolled up tortillas so that it gets to the bottom of the pan.\n\n8 Add sour cream and garnishes: Top with crumbled cotija cheese, chopped red onion, and chopped fresh cilantro.\n\nThin the sour cream with a tablespoon of water and drizzle all over the top of the enchiladas. (Don't skip the sour cream! It's essential to balance the sharp acidity of the salsa verde.)\nServe immediately.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2008/08/chicken-enchiladas-verdes-vertical-a-1600.jpg"
  },
  {
    "title": "One-Pot Chicken and Rice Soup Recipe",
    "description": "One-Pot Chicken and Rice Soup! Throw bone-in chicken, rice, and vegetables together in a pot and simmer until they're done. It's the easiest soup ever, ready in under an hour.",
    "prepTime": "15 minutes",
    "cookTime": "30 minutes",
    "yeild": "6 to 8 servings",
    "ingredients": "\n2 bone-in chicken breasts, skin removed (1 to 1 1/2 pounds)\n1 cup long-grain white rice, like basmati\n2 celery ribs, diced small\n2 medium carrots, peeled and diced small\n1 onion, diced small\n2 cloves garlic, peeled but left whole\n1 teaspoon salt, plus more to taste (see Recipe Note)\n1/2 teaspoon ground black pepper\n2 quarts unsalted or low-sodium chicken stock\nJuice of 1/2 lemon (about 3 tablespoons)\nChopped fresh parsley, for serving\n",
    "directions": "1 Assemble the soup and bring to a simmer: Combine the chicken, white rice, celery, carrots, onions, garlic, salt, and pepper in a large pot. Add the chicken stock and bring to a boil over high heat.\nOnce the soup is boiling, reduce the heat to keep the soup at a gentle simmer.\n\n2 Simmer for about 25 minutes: As the soup simmers, skim off any foam that collects on the surface with a spoon. Continue to simmer until the rice and vegetables are tender, about 25 minutes. Remove the soup from heat.\n3 Shred the chicken and make the garlic paste: Remove the chicken and garlic cloves using a slotted spoon or tongs. Transfer the chicken breasts to a bowl and shred with two forks. Discard the bones. Return the shredded chicken to the pot.\nSmash the garlic cloves into a paste against a cutting board using a fork or the flat of your knife. Stir the paste back into the soup.\n\n4 Season and serve: Stir the lemon juice into to the soup, and taste. The soup should taste rich, barely salty, and with just a hint of lemon. Add more salt or lemon juice as needed until it tastes good to you.\nDivide among bowls and sprinkle with some parsley for serving.\nLeftovers will keep for about a week refrigerated, or up to 3 months frozen.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/09/2017-10-23-ChickenRiceSoup-5.jpg"
  },
  {
    "title": "Indian Butter Chicken Recipe",
    "description": "Butter Chicken simmers in a buttery tomato sauce and is punctuated by several special spices and herbs. Skip the Indian takeout and cook up your very own version of the popular dish!",
    "prepTime": "30 minutes",
    "cookTime": "30 minutes",
    "yeild": "4 servings",
    "ingredients": "\n1 pound boneless, skinless chicken thighs, cut into roughly 1-inch cubes\n1/4 cup full-fat plain yogurt\n1 tablespoon olive oil\n1 tablespoon ginger garlic paste\n1 teaspoon dried coriander\n1 teaspoon Kashmiri Lal Mirch\n1 teaspoon cumin\nSalt to taste\n\n8 to 10 whole almonds\n8 to 10 whole cashews\n2 tablespoons unsalted butter, divided\n1 tablespoon ginger garlic paste\n1 teaspoon sugar\n1 (15-ounce) can canned diced tomatoes\n2 tablespoons dried coriander\n1 1/2 teaspoons ground Garam Masala\n1/2 teaspoon ground Kashmiri Lal Mirch\n1/2 teaspoon salt\n1 cup water\n1/4 cup heavy cream\n1/2 tablespoon Kasuri Methi\n\nCooked rice, roti, or naan bread\n",
    "directions": "1 Marinate the chicken: Bring the chicken and the rest of the marinade ingredients together in a large bowl. Using your hands, massage the marinade into the chicken.\nCover with plastic wrap and refrigerate for at least 1 hour, or up to overnight.\n\n2 Soak cashews and almonds in water for at least an hour to (or up to overnight) before preparing the rest of the recipe.\n3 Cook the chicken: Heat a skillet or grill pan over medium-high heat. Drizzle a teaspoon of oil to the pan.\nWorking in batches, remove chicken from the marinade and grill them on the pan for 3 to 5 minutes on each side, until the chicken is cooked through (clear juice runs out of it when you cut into it). Do not crowd the pan.\nOnce cooked, transfer the chicken into a separate dish. Cover and set aside for later.\n\n4 Start making the sauce: Melt 1 1/2 tablespoons of the butter in a medium sized Dutch oven or a skillet on medium low heat. As soon as the butter melts, add the ginger garlic paste followed by sugar. Sauté for 1 to 2 minutes.\nStir in the tomato and cook for 8 to 10 minutes on medium high heat, until all the extra liquid is cooked off. The sauce should be a loose, paste-like consistency.\nAdd coriander, garam masala, Kashmiri Lal Mirch, and salt. Stir and cook on medium heat for 2 to 3 minutes. Turn off the heat.\n \n5 Puree the sauce with the nuts: Transfer the paste to a blender or the bowl of a food processor. Add the soaked cashews and almonds. Blend into a smooth paste.\n\n6 Finish the dish: Return the paste to the cooking pan over medium heat. Add the water to the paste and stir to make a smooth sauce.\nAs the sauce begins to boil, add the grilled chicken and heavy cream. Stir well. Cover the pan and simmer for 5 minutes.\n \n7 Rest the butter chicken: Turn off the heat and uncover the pan. Stir in the remaining 1/2 tablespoon butter and the kasuri methi. Cover again, and let the dish rest for 8 to 10 minutes so the flavor of kasuri methi can marry into the butter chicken.\n8 Serve: Serve the butter with a side of steamed basmati rice, roti, or naan. Leftovers will keep refrigerated, covered, for five days.\nYou can freeze this dish in an airtight covered container or a zip-top bag for a month. Thaw and reheat in a saucepan over medium-low heat to retain the texture.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/01/Butter-Chicken-LEAD-5.jpg"
  },
  {
    "title": "Pressure Cooker BBQ Chicken Stuffed Sweet Potatoes Recipe",
    "description": "Barbecued chicken and sweet potatoes in the pressure cooker: the perfect combo for a weeknight dinner. Everything cooks in one pot—including the barbecue sauce! ",
    "prepTime": "5 minutes",
    "cookTime": "45 minutes",
    "yeild": "6 servings",
    "ingredients": "\n1 1/2 pounds boneless skinless chicken breasts (if they’re more than 8 ounces, cut them in half)\n1/2 teaspoon salt\n1/2 teaspoon ground black pepper\n1 tablespoon vegetable oil\n1 medium yellow onion, sliced\n2 cloves garlic, chopped\n6 (4 1/2 to 6 ounces each) sweet potatoes\n1/2 cup water\n1/2 cup barbecue sauce (homemade or your favorite brand)\n\n3/4 cup grated cheese (cheddar, Monterey Jack, or a blend)\n2 tablespoons chopped fresh cilantro\n2 green onions, sliced thinly\n",
    "directions": "1 Sear the chicken: Season the chicken breasts all over with the salt and pepper.\nSelect the Sauté setting on your electric pressure cooker and heat the oil for 3 minutes, until shimmering. Using a pair of tongs, lower the chicken breasts into the pot and sear them for 3 minutes per side (6 minutes total), until lightly browned. Transfer the chicken to a dish.\n  \n2 Cook the onions and garlic: Add the onion to the pot and sauté for about 2 minutes, until it starts to soften. Add the garlic and sauté another 30 seconds or so, just until it is no longer raw.\n\n3 Assemble everything in the pressure cooker: Add the water and use a wooden spoon to nudge any browned bits off of the bottom of the pot. Add the chicken back to the pot, nestling it in with the onions and garlic.\nLower a tall metal steam rack into the pressure cooker, making sure all of its legs are touching the bottom of the pot. Arrange the sweet potatoes on top of the rack in a single layer.\n \n4 Pressure cook the potatoes and chicken: Secure the lid on your pressure cooker in its Sealing position. Cancel the Sauté program, then select the Manual or Pressure Cook program for 10 minutes at high pressure. (It will take about 10 minutes for the pot to come up to pressure before the cooking program begins.)\nWhile the recipe cooks, line a sheet pan with foil and set it aside.\n\n5 Release the pressure: As soon as the cooking program ends, perform a quick pressure release by moving the Pressure Release to its Venting position, releasing the steam. (At this point, the pressure cooker can be left on the “Warm” setting for up to 10 hours.)\nUse tongs to gently transfer the sweet potatoes to the foil-lined sheet pan. Remove the chicken to a cutting board or dish.\n  \n6 Make the BBQ sauce: Stir the barbecue sauce in with the liquid and onions in the pot. Cancel the Keep Warm program, select the Sauté setting, and let the mixture boil and reduce for 8 to 10 minutes, stirring occasionally, until thick and glazy (the timing will vary slightly depending on how much sugar is in your barbecue sauce).\n\n7 While the sauce is reducing, use a pair of forks to shred the chicken.\n\n8 Mix the chicken with the BBQ sauce: Turn off the Sauté program. Add the chicken back to the pot and toss to combine.\n\n9 Stuff the potatoes and broil: (You can skip this step if you like. Everything is already cooked through—it’s just to get the cheese bubbly and browned.)\nHeat your broiler to high with a rack positioned a few inches below the heating element.\nSplit the sweet potatoes in half lengthwise, then stuff them with the chicken mixture. Top each sweet potato with two tablespoons of shredded cheese.\nBroil for 2 to 3 minutes, until the cheese is bubbly and beginning to brown in spots. Remove from the oven, then sprinkle with cilantro and green onions. Serve hot.\nLeftovers will keep for 3 to 4 days and can be reheated in the microwave.\n  \n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/01/PC_BBQ_sweet_potatoes_METHOD00030.jpg"
  },
  {
    "title": "Homemade Chicken Noodle Soup Recipe",
    "description": "BEST homemade chicken noodle soup! This version is made from scratch, so it's light and nourishing. All the goodness from the chicken in one pot of soup. Just what you need to recover from a cold or the flu.",
    "prepTime": "15 minutes",
    "cookTime": "2 hours",
    "yeild": "3 to 4 servings",
    "ingredients": "\nOne 3 1/2-pound chicken, cut into parts—breast, thighs, backs, wings and neck (if available)\n5 carrots (2 carrots scrubbed clean, but not peeled, cut into 2 inch chunks for the stock, 3 carrots peeled and cut into 1/4-inch rounds for the soup)\n5 ribs celery (2 ribs cut into 2 inch pieces for the stock, 3 ribs cut into 1/4-inch thick slices for the soup), including celery tops for the stock\n1 onion, quartered (for stock, peel on is okay)\n3 cloves of garlic, peel on, cut in half\n2 to 3 sprigs fresh thyme (or a teaspoon of dried)\n1 bunch parsley\n5 whole peppercorns\nSalt\n4 to 8 ounces egg noodles (depending on how noodle-y you want your soup)\nFreshly ground black pepper\n",
    "directions": "1 Separate breast and thigh meat from bones: Remove the breast meat from the breast bones, and the thigh meat from the thigh bone, place in a bowl, cover and chill in the refrigerator until needed towards the end of preparing the soup.\nRemove and discard the largest pieces of breast and thigh skin. Cut away and discard excess fat from chicken pieces.\n2 Parboil bones for 3 minutes: Place breast and thigh bones, the back, leg, neck, and wings in a large (8 quart) pot. Cover with water. Bring to a full rolling boil. Boil for 3 minutes. After 3 minutes, remove from heat, drain off the water, rinse the bones and the pot.\n \n3 Make stock with parboiled bones, celery, carrots, onion, garlic, thyme, parsley, peppercorns: Return the now parboiled bones to the clean pot.  Add a couple carrots and a couple celery ribs, each cut into 2 inch chunks, and some celery tops if you have them, to the pot with the chicken. (Fennel tops or leek greens can be added too, if you have them.)\nAdd the quartered onion, garlic cloves, thyme, one-half of the parsley, and the peppercorns to the pot.\n \nCover with an inch or two of water (about 3 quarts).  Bring to a low simmer (about 185°F) and let simmer (the stock should be just barely bubbling), partially covered, for 1 1/2 hours.\n4 Strain bones and solids from the stock: At the end of 1 1/2 hours strain out the bones and vegetables, reserving the stock. If you want, set aside and strip the bones of any remaining meat. After parboiling and 1 1/2 hours of cooking the meat will be rather dry and tasteless, though you could use it in a chicken salad.  Rinse out the pot and return the stock to the pot.\n \n 5 Salt the stock: Taste the stock. It should be rather bland because up to now, no salt has been added. Add salt to taste. As a guideline, for each quart of stock, add 2 teaspoons of salt.\n6 Add carrots, celery: Add the sliced carrots and celery to the stock, bring to a simmer.\n\n7 Cut raw chicken breast and thigh meat, add to stock: Cut the chicken breast and thigh meat into bite-sized pieces.  Add to the pot with the carrots, celery, and stock. Return to a low simmer.\n \n8 Add noodles, bring to simmer: Add the egg noodles and return to a simmer. Note that the noodles will expand substantially in the soup broth as they cook.\n\nSimmer for until the egg noodles are just barely cooked through, al dente (about 5 minutes or so, depending on your package of noodles), and the chicken is just cooked through.\n9 Add parsley, salt, pepper, thyme to serve: Stir in a handful of chopped fresh parsley. Add freshly ground black pepper, more thyme, and more salt to taste.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2013/01/chicken-noodle-soup-vertical-a-1600.jpg"
  },
  {
    "title": "Chicken Tikka Masala Recipe",
    "description": "Chicken Tikka Masala! This recipe is so EASY! It's made on the stovetop and tastes just like take-out. Ready in about 30 minutes, this Chicken Tikka Masala can be on the table in no time.",
    "prepTime": "15 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 1/4 pounds boneless skinless chicken breasts, thighs, or a mix\n6 tablespoons plain whole milk yogurt\n1/2 tablespoon grated ginger\n3 cloves of garlic, minced\n1 teaspoon cumin\n1 teaspoon paprika\n1 1/4 teaspoons salt\n\n2 tablespoons canola oil, divided\n1 small onion, thinly sliced (about 5 ounces, or 1 1/2 cups sliced)\n2 teaspoons grated ginger\n4 cloves garlic, minced\n1 tablespoon ground coriander\n2 teaspoons paprika\n1 teaspoon garam masala\n1/2 teaspoon turmeric\n1/2 teaspoon freshly ground black pepper\n1 14-ounce can crushed fire-roasted tomatoes (regular crushed tomatoes work, too)\n6 tablespoons plain whole milk yogurt\n1/4 to 1/2 teaspoon cayenne pepper\n1/2 teaspoon salt\nCooked rice, to serve\nCilantro, to garnish\n",
    "directions": "1 Prepare the chicken: Trim chicken thighs of any extra fat. Chop into bite-sized pieces about 1/2 to 1 inch wide. Place the chicken thigh pieces to a medium bowl.\nAdd the yogurt, ginger, garlic, cumin, paprika and salt. Using your hands, combine the chicken with the spices until the chicken is evenly coated.\n\n2 Marinate the chicken: Cover the bowl with plastic wrap and let the chicken marinate in the fridge for at least 45 minutes or as long as overnight. (Marinating for 4 to 6 hours is perfect.)\n\n3 Cook the chicken: In a large skillet, heat 1 tablespoon of canola oil over medium-high heat. Add the chicken thigh pieces and cook for about 6 to 7 minutes, until they’re cooked through. Transfer to a plate and set aside.\n \n4 Toast the spices: Wipe down the pan you used to cook the chicken. Heat remaining canola oil over medium heat. Add the onions and cook for 5 minutes, until softened, stirring often.\nAdd the grated ginger, minced garlic, coriander, paprika, garam masala, turmeric, black pepper, salt and cayenne. Let the spices cook until fragrant, about 30 seconds to a minute.\n\n5 Make the sauce: Add the crushed tomatoes to the pan with the spices and let everything cook for 4 minutes, stirring often. Add the yogurt and stir to combine.\n \n6 Simmer the sauce: Reduce the heat to medium-low and let the sauce simmer for another 4 minutes. Add the chicken pieces to the pan and coat with sauce.\n\n7 Serve: Serve over cooked basmati rice and garnish with cilantro.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/02/2017-02-27-ChickenTikkaMasala-16.jpg"
  },
  {
    "title": "Red Chili Chicken Enchiladas Recipe",
    "description": "Our favorite red chili chicken enchiladas! Corn tortillas are dipped in red chili sauce to bake in the flavor in this easy chicken enchiladas recipe. Simple make-ahead midweek dinner. Reheats well for leftovers!",
    "prepTime": "15 minutes",
    "cookTime": "35 minutes",
    "yeild": "4 servings",
    "ingredients": "\nOlive oil, canola oil, or rice bran oil\n12 corn tortillas (thick and sturdy)\n2 14-ounce cans red chile enchilada sauce, or 3 cups homemade enchilada sauce\n2 cups cooked chicken, shredded or chopped\n2 cups grated cheese (about 1/3 lb)\n\n1 Tbsp vegetable oil\n5 Tbsp chili powder\n1/2 teaspoon of cayenne\n1/2 cup tomato paste\n3 cups water\n1 teaspoon garlic powder\n1 teaspoon onion powder\n1/2 teaspoon ground cumin\n1/2 teaspoon ground oregano\n1 teaspoon salt\n1 Tbsp of cornstarch mixed in with 3 Tbsp of water to form a slurry\n\n1 medium red onion, chopped, soaked in a mixture of half seasoned rice vinegar and half water\nChopped fresh cilantro\nThinly sliced iceberg lettuce seasoned with salt and vinegar, no oil\nSour cream\nSliced avocados or guacamole\n",
    "directions": "1 Prepare the enchilada sauce: (if making homemade, otherwise use canned and skip to the next step). Heat the oil in a sauce pan on medium high heat.\nStir in the chili powder and cayenne. Let cook only for half a minute (if longer the chili will burn), and add the water and tomato paste. Whisk until smooth.\nAdd the garlic powder, onion powder, cumin, oregano, salt, and cornstarch slurry. Let come to a simmer and remove from heat.\nTaste for heat. If you want it spicier, add more chili powder or cayenne. Note that the tortillas and chicken will absorb some of the heat, so allow for that and let it be a little bit spicier than what you want in the finished dish.\n2 Mix in 1/4 cup of the sauce with the cooked chicken. Set aside.\n3 Prepare the tortillas: Traditionally, one would dip the tortillas in some sauce and then lightly fry them in a little oil, and then roll them up. It's a great way to infuse the tortillas with the chili sauce, but it's really messy and many tortillas are not sturdy enough to handle this treatment without falling apart.\nSo, instead, we soften the corn tortillas first, and then dip them in the sauce before rolling them. To soften them, and give them a little flavor from browning, I'll show you my mother's method for cooking the tortillas without using a lot of fat.\nHeat a tablespoon of oil (a high smoke point oil is preferred such as peanut oil, canola oil, or rice bran oil) in a small saucepan to coat the pan. Place a tortilla in the skillet and heat for a few seconds, until the tortilla begin to show some air bubbles.\n \nUse a metal spatula to flip to the other side for a few more seconds. Then add another tortilla on top of the first to soak up some of the excess oil. Flip them both together and add yet another tortilla.\n \nKeep adding them wherever there seems to be some excess oil. The idea is to heat the tortillas and soften them with the minimum amount of oil.\nAs the tortillas become soft and heated, remove them to a paper towel to soak up even more excess oil. When you find you need more oil in the pan, add it.\n4 Assemble the enchiladas: Preheat the oven to 350°F. One by one, dip a tortilla in the enchilada sauce and place in a 9x13 Pyrex baking dish.\nPlace 2 to 3 tablespoons of chopped chicken in each tortilla. Sprinkle with a little cheese.\n \nRoll up the tortilla. Place in the baking dish and repeat until all dozen of your tortillas are neatly placed in rows in the casserole dish.\n \nCover the tortillas rolls with the remaining sauce. Sprinkle with the remaining grated cheese.\n \nI recall often eating these chicken enchiladas with very little cheese on them. (My mom, bless her soul, has no recollection of the chicken enchiladas without the sprinkled cheese. But she's in her 80s and sometimes doesn't remember these things. Or she remembers later and doesn't remember that she ever forgot them in the first place. But heck, I'm in my 50s and my memory isn't what it used to be either.)\n5 Bake: Place in the oven and bake at 350°F for 10 minutes, or until cheese is bubbly.\nUse a metal spatula to serve.\nServe with thinly sliced iceberg lettuce that has been seasoned with vinegar and salt (no oil), chopped red onions that have soaked for at least half an hour in vinegar and water, guacamole or avocado slices, and sour cream. Garnish with cilantro.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/04/red-chili-chicken-enchiladas-vertical-a-954.jpg"
  },
  {
    "title": "Pressure Cooker Teriyaki Chicken Wings Recipe",
    "description": "Pressure Cooker Teriyaki Chicken Wings take the party to the next level. The pressure cooker means tender, fully-flavored wings in no time, and a quick pass under the broiler makes them crispy. Toss with more sauce for a sticky, sweet party snack!",
    "prepTime": "5 minutes",
    "cookTime": "40 minutes",
    "yeild": "3 to 4 servings",
    "ingredients": "\n3/4 cup soy sauce\n6 tablespoons mirin\n1/4 cup sake\n1/4 cup packed dark brown sugar\n1 teaspoon minced garlic, about 1 medium garlic clove\n1 teaspoon minced fresh ginger, from about a 1-inch knob\n3 pounds chicken wing drumettes and flats\n\n4 to 5 teaspoons cornstarch\n4 to 5 teaspoons soy sauce\n\n1/2 teaspoon sesame seeds\n1 green onion, thinly sliced\n",
    "directions": "1 Make the teriyaki sauce: Combine the soy sauce, mirin, sake, brown sugar, garlic, and ginger. Stir to mix in the sugar (it won’t completely dissolve and that’s OK).\n2 Pressure cook the wings: Combine the teriyaki sauce and wings in the pressure cooker. Toss the wings to coat. Seal the pressure cooker and make sure the steam valve is set to “sealing”.\nPress the “Poultry” button and adjust the time to 10 minutes. Make sure it is set to “high pressure.”\nThe pressure cooker will come to pressure in 15 minutes, then cook for 10 minutes.\n3 Vent the pressure: Once the pressure cooker is done cooking, do a quick release of the pressure by carefully moving the steam valve to the “venting” setting. (I wear an oven mitt and use a wooden spoon to flick the valve because I’m overly cautious.)\n4 Get ready for broiling: While the steam is being released, turn your oven broiler on. Line a rimmed baking sheet with aluminum foil and lightly coat the foil with cooking oil spray.\n5 Broil the chicken wings: Once the steam has been released, open the pressure cooker. Using tongs, move the wings to the prepared baking sheet and place under the broiler for 4 to 5 minutes or until the chicken skin is starting to char.\nFlip all the wings and repeat to char the other side.\n\n6 Reduce the teriyaki sauce: While the chicken wings are broiling, thicken the teriyaki sauce. Start by pressing the “sauté” button on the pressure cooker.\nIf you plan on serving the wings at room temperature, stir together 4 teaspoons of cornstarch and 4 teaspoons of soy sauce in a small bowl until the cornstarch is dissolved, then add to the simmering teriyaki sauce.\nIf you plan on serving the wings hot, use all 5 teaspoons of both ingredients.\nCook the sauce until it starts to boil, stirring frequently, about 3 minutes.  The sauce should start to thicken a bit and look like maple syrup, but won’t look super thick. Don’t worry, it will thicken further as it cools.\n \n7 Toss the broiled wings with the teriyaki sauce: Turn the pressure cooker off. Once the wings are done in the broiler, transfer them back to the pressure cooker with the thickened sauce.\nToss to coat the wings, then move them to a serving platter.\n\n8 Serve: Sprinkle wings with sesame seeds and sliced green onions and serve hot or room temperature.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/01/PC-Teriyaki-Chicken-LEAD-3.jpg"
  },
  {
    "title": "Sous Vide Chicken and Broccoli Recipe",
    "description": "Hate dry, overcooked chicken? Sous vide is the way to go! This method makes juicy, tender chicken every time. Pair it with sous vide broccoli for easy make-ahead lunches and dinners!",
    "prepTime": "20 minutes",
    "cookTime": "2 hours",
    "yeild": "4 to 6 servings",
    "ingredients": "\n4 medium chicken breasts (6 to 8 ounces each)\n1 teaspoon salt\n1/4 teaspoon black pepper\n1 lemon, sliced thin\n1 1/2 pounds broccoli florets\n2 teaspoons sesame oil\n1/2 teaspoon red pepper flakes\nPinch of Kosher, sea or table salt\nSous vide immersion circulatorGallon-sized zip-top plastic freezer bags",
    "directions": "1 Heat the water: Fill a pot with water and place your immersion circulator inside. Set the temperature to 158°F and let the water come up to temperature.\n2 Prep the chicken: Season the chicken breasts with salt and pepper, and place them in gallon-sized zip-top freezer bag with the lemon arranged over top.\nMake sure the chicken is in a single layer. If you need to use two bags, that’s better than having overlapping chicken pieces.\n\n3 Seal the bag: Seal the bag with as little air as possible by using water-displacement method to press out all the air: Just slowly lower the bag with the chicken into the water, letting the pressure of the water press the air out of the bag. Once the top of the bag reaches the water line and all the air has been pressed out, seal the bag. (Read more here.)\nYou can do this in the pot of water as it heats. (Just be careful if the water is already steaming!)\nSet the chicken aside on a kitchen towel until the water has finished heating. At this point you can also freeze the bag if you want to store the prepared chicken for later.\n\n4 Prepare the broccoli: Place the florets in a gallon-sized zip-top freezer bag, and season with red pepper flakes and sesame oil. To weight the broccoli down, add a few heavy soup spoons to the bag (or plan to place a heavy bowl over the top of the water bath to keep the broccoli submerged).\nUse the same water displacement technique to seal the broccoli bag.\n\n5 Cook the broccoli and chicken. Once the water has come to temperature, add the chicken and broccoli to the water and cook for 2 hours. Make sure your cooking bags are completely submerged in the water; place a heavy bowl over the pot if the spoons aren't keeping the broccoli submerged.\nI also like to rotate all the bags halfway through cooking to make sure they are cooking evenly, as sometimes they can get jostled around in the water.\nWhen cooking time ends, remove from the water and turn off the circulator.\n  \n6 Serve the chicken: Remove the chicken and broccoli and portion in lunch-sized portions or serve for dinner.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/06/Sous-Vide-Chicken-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Hearty Roasted Vegetable and Chicken Stew Recipe",
    "description": "When it's cold and you need to warm up from the inside, this Hearty Roasted Vegetable and Chicken Stew is precisely what you need. It's creamy and thick with chunks of carrot, potato, and mushroom. A sunny blend of spices (turmeric, cumin, and harissa) perks up the whole pot.",
    "prepTime": "50 minutes",
    "cookTime": "25 minutes",
    "yeild": "6 servings",
    "ingredients": "\n8 ounces baby bella mushrooms, quartered\n4 large carrots, peeled and cut into 1/2-inch thick rounds\n1 1/2 pounds Yukon gold potatoes, cubed (about 5 medium-sized potatoes)\n5 tablespoons olive oil, divided\n1 1/2 teaspoons kosher salt, divided\n1 1/2 teaspoons freshly ground black pepper, divided\n1/2 teaspoon harissa powder\n4 chicken thighs, skin-on and bone-in (about 1 1/2 pounds)\n1/4 cup all-purpose flour\n1/2 large yellow onion, chopped\n3 large cloves garlic, minced\n1/2 teaspoon ground cumin\n1 teaspoon ground turmeric\n1/3 cup white wine\n6 cups (48 ounces) chicken stock\n2 bay leaves\n3 large kale leaves (any variety),  stripped from the stem and torn\n",
    "directions": "1 Preheat the oven to 425°F. \n2 Roast the veggies: Spread chopped mushrooms, carrots, and potatoes on a baking sheet in three separate rows, keeping each vegetable separate from the others—this will come in handy later when you have to add them to the soup in separate steps.\nDrizzle 3 tablespoons of olive oil over the vegetables, then sprinkle with 3/4 teaspoon of salt, 3/4 teaspoon freshly ground pepper, and 1/2 teaspoon harissa. Toss each individual row to coat.\nRoast veggies in oven for 20 to 25 minutes. When they are fork tender, set them aside while you finish the soup base. (Note: You don't actually want the veggies to brown too much for this recipe; you want the colors to stay vibrant.)\nWhile the vegetables roast, cook the chicken and begin assembling the stew.\n\n3 Cook the chicken: Heat 2 tablespoons oil in Dutch oven or large heavy-bottomed soup pot set over medium heat. Trim the chicken of excess fat and skin. Sprinkle the four chicken thighs with 3/4 teaspoon salt and 3/4 teaspoon freshly ground pepper.\nOnce the oil begins to shimmer, add the thighs skin side down. Cook the thighs for 7 minutes, until the skin has a nice golden brown color.\nFlip the chicken and cook for another 5 minutes. A few bits of skin may stick to the pan when you flip. That’s ok.\nAfter cooking, the skin should be crisp and golden, and you should have about a 1/4 cup of fat in the pan. (Just eyeball it; you’ll be fine!) The chicken will not be completely cooked, which is ok; transfer it to a plate.\n\n4 Make the roux: Sprinkle 1/4 cup all-purpose flour over the chicken fat. Use a sturdy wooden spoon to stir continuously and scrape the brown bits (the fond) off the bottom of the pan.\nContinue cooking until the color deepens and it looks like golden paste, about 6 minutes. This is the roux that will thicken your soup.\n\n5 Cook the onion and garlic. Add the chopped onion, minced garlic, turmeric, and cumin to the pan with the roux. Continue to stir and scrape the bottom of the pan. The roux will get crumbly, and the color will continue to deepen. That’s ok.\nKeep stirring and scraping the bottom of the pan for about 5 minutes until the onions are cooked through.\n\n6 Stir in the wine and stock: Slowly add 1/3 cup of white wine, scraping the bottom of the pan to release any brown bits, and stir for another minute.\nSlowly pour in the stock, you guessed it, while stirring! Add the bay leaves and bring it to a gentle simmer.\n\n7 Add the chicken and simmer: Remove the skin from the chicken thighs and discard. Add the thighs to the pot of simmering stock.\nCover with a lid, but leave it slightly ajar. Continue to simmer over medium low heat for 25 minutes, stirring occasionally. Don’t let it boil.\n\n8 Add half the roasted potatoes and carrots and puree: Use tongs to remove bay leaves and chicken from the pot and transfer to a plate.\nAdd half of the roasted potatoes and half of the carrots to the pot (reserve the mushrooms). Use an immersion blender to puree the vegetables into the soup.\n\n9 Finish the stew: After pureeing, add the remaining vegetables, including all of the mushrooms, and let them warm through.\nWhen the chicken has cooled enough to handle, use two forks to shred it into bite-sized pieces. Discard the bones. Add the chicken back to the pot.\nStir in the kale. Let everything warm through over low heat for a couple of minutes and make sure the kale is wilted.\n\n10 Serve:  Ladle into bowls and serve with fresh crusty bread. Leftovers will keep in the refrigerator for about a week, or up to 1 month frozen.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/12/Roasted-Veg-Chicken-Stew-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Pressure Cooker White Chicken Chili Recipe",
    "description": "This White Chicken Chili is proof that chili doesn't have to be red and beefy to be delicious. Plus, this version is ready in a fraction of the time thanks to the pressure cooker! ",
    "prepTime": "10 minutes",
    "cookTime": "45 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n2 tablespoons olive oil\n4 cloves garlic, minced\n1 large green bell pepper, seeded and chopped\n2 jalapeño peppers, seeded and chopped (leave the seeds in if you like it spicy)\n3 celery stalks, chopped\n1 medium yellow onion, chopped\n2 teaspoons ground cumin\n2 teaspoons dried oregano\n1 teaspoon ground coriander\n1/4 teaspoon cayenne pepper (optional)\n2 teaspoons salt\n2 (15-ounce) cans cannellini beans, rinsed and drained (or 3 cups homemade beans)\n1 1/2 pounds boneless, skinless chicken breasts, tenders, or thighs\n1 cup chicken broth\n1 cup sour cream\n1/2 cup chopped fresh cilantro\n6-quart electric pressure cooker, like the Instant Pot",
    "directions": "1 Sauté the garlic and vegetables: Select the sauté setting on your pressure cooker and heat the olive oil and garlic for 2 minutes, until the garlic is bubbling.\nAdd the bell pepper, jalapeños, celery, and onion, and sauté for about 5 minutes, until the vegetables are softened.\n  \n2 Add the spices, beans, and chicken: Add the cumin, oregano, coriander, cayenne, and salt and sauté for about 1 minute more, until aromatic.\nPour the beans over the vegetables, layer the chicken pieces on top, and pour in the broth. Do not stir. \n\n3 Pressure cook the chicken: Secure the lid on your pressure cooker in its sealing position. Cancel the sauté program, then select the manual setting and set the cooking time for 15 minutes at high pressure. (The pot will take about 10 minutes to come up to pressure before the cooking program begins.) \n\n4 Release the pressure: Perform a quick pressure release by moving the pressure cooker’s lid to its vented position, or let the pressure release naturally.\nAt this point, you can also leave the chili on your pressure cooker’s Keep Warm setting for up to 10 hours, then continue with the recipe when you’re ready to serve.\n\n 5 Shred and season the chicken: When the pressure has fully released, open the pot and use a pair of tongs to remove the chicken to a carving board or dish. Using a pair of forks, break up the chicken into shreds.\nAdd the shredded chicken back to the pot along with the sour cream and cilantro and stir to combine. Taste for seasoning and add more salt if needed.\n   \n6 Serve the chili: Ladle the chili into bowls. Serve hot, with tortillas or cornbread on the side.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/12/PC-White-Chicken-Chili-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Baked Chicken Taquitos Recipe",
    "description": "Taquitos! They're fun to say and fun to eat, they freeze well and please kids. These are filled with chicken, cheese, and seasonings, and then baked to crispy perfection. ",
    "prepTime": "20 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 to 5 servings",
    "ingredients": "\n2 cups (about 1 pound) cooked shredded chicken (see Recipe Note)\n4 ounces cream cheese\n1 cup (4 ounces) grated cheddar cheese\n4 ounces canned mild green chilis\n1 teaspoon mild chili powder\n1 teaspoon ground cumin\n1/2 teaspoon garlic powder\n1/2 teaspoon salt\n18 to 20 (6-inch) corn tortillas\nVegetable oil, for brushing\n\nFresh cilantro\nSour cream\nMild salsa\n\n1/4 cup sour cream\n1 tablespoon Sriracha hot sauce\n",
    "directions": "1 Preheat  the oven to 350°F. Lightly oil a rimmed baking sheet.\n2 Make the taquito mix: In a medium bowl, mash together shredded chicken, cream cheese, cheddar cheese, green chilis, and seasonings. Mix together really well.\nTaste and feel free to adjust seasonings to your liking. This basic version should be fairly mild and kid-friendly.\n \n3 Prep the tortillas: Wrap the corn tortillas in stacks of two in between damp paper towels. Microwave on high for 20 seconds to make them more flexible.\n\n4 Assemble the taquitos: Add two heaping tablespoons of the chicken filling to each tortilla and wrap tightly—a small cookie scoop (like this one) works well here. They should resemble long cigars.\nImmediately brush corn tortillas with vegetable oil to prevent cracking and place, seam-side down, on the lightly oiled baking sheet.\nRepeat until all of the filling is used. You should get 18 to 20 taquitos.\n \n5 Bake the taquitos: Bake the taquitos as soon as possible to prevent the tortillas from cracking too much. Bake for 20 to 25 minutes until they are crispy and golden brown.\nIf some of your tortillas crack badly, you can try again with a new tortilla and just transfer the filling over. Ultimately, though, a few cracks are okay and the taquitos can still be picked up and eaten—and they are still delicious!\n\n6 Make the cream sauce: While the taquitos bake, stir together the sour cream and sriracha. Taste and adjust to your liking. This can be made well in advance and keeps just fine for a few days in a covered container in the fridge.\n7 Serve: Serve immediately with the cream sauce. Leftovers can be frozen for up to a month and reheated in a warm oven.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/12/EYF-Chicken-Taquitos-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Sheet-Pan Harissa Chicken with Carrots and Cauliflower Recipe",
    "description": "Sheet Pan Harissa Chicken! If you're not familiar with harissa, it's a blend of chiles, spices, garlic, and olive oil. It livens up simple chicken and veggies in this sheet-pan dinner!",
    "prepTime": "15 minutes",
    "cookTime": "1 hour, 30 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1/4 cup harissa paste (See Recipe Note if using harissa powder)\n2 to 4 tablespoons olive oil, divided\n1 teaspoon ground coriander\n1 teaspoon ground cumin\n8 bone-in chicken pieces (about 2 1/2 pounds), thighs, legs, breasts, or a mix\n1 medium head cauliflower\n1 large sweet onion\n4 medium carrots\n1 lemon, very thinly sliced\n1 teaspoon salt, divided\n1/2 cup water\n2 tablespoons chopped fresh cilantro\nCooked rice or pasta (thin spaghetti works well) to serve\n",
    "directions": "1 Make the marinade: In a bowl, stir the harissa paste with 2 tablespoons of the olive oil, coriander, and cumin. The mixture should form a paste that just drops off the spoon. Stir in the remaining olive oil, if needed, a little at a time.\n\n2 Marinate the chicken: If using thighs or legs, trim the excess skin and fat; transfer the thighs or legs or breasts to a bowl. Add half the harissa mixture and turn the chicken until it is thinly coated all over.\nCover and refrigerate for at least 1 hour, or for up to 12 hours. Refrigerate the remaining marinade separately until needed.\n\n3 Prep the vegetables: Remove the green leaves from the cauliflower but do not core it. Cut the cauliflower into florets and stalks, and transfer them to a large rimmed baking sheet.\nPeel and cut the carrots into 2-inch pieces. Cut the thinner pieces half down the length; cut the larger, thicker pieces into quarters. Peel and cut the onion in half and slice 1/4-inch thick.\n4 Cook the vegetables: Heat the oven to 425°F. Combine the cauliflower, onions, carrots, and lemon slices on a sheet pan. Add dabs of the remaining harissa mixture here and there over the vegetables. Sprinkle evenly with 1/2 teaspoon of salt. Add the water to the edge of the pan.\nCover the pan with foil and cook the vegetables and the sliced lemons for 20 minutes. Remove and toss gently. Continue cooking for about 15 minutes, uncovered, or until the vegetables are almost tender when pierced with a skewer. Remove from the oven and turn again gently.\n\n5 Cook the chicken and vegetables: Increase the oven temperature to 450°F. Set the chicken, skin side up, on the vegetables. Sprinkle evenly with 1/2 teaspoon of salt.\nContinue cooking, uncovered, for 25 to 30 minutes, until the chicken is cooked through (breasts will register 160°F on a meat thermometer; legs and thighs 180°F). The vegetables will be very tender and are meant to be served quite soft.\n\n6 Serve: Remove from the oven, sprinkle with cilantro, and serve with rice or spaghetti.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/11/Sheet-Pan-Harissa-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Rotisserie Chicken Noodle Soup Recipe",
    "description": "This quick chicken noodle soup using rotisserie chicken is a winner if you're cooking a family dinner. Kids love soup! You can make it quickly, freeze it, and even add a soft-boiled egg to take it up a notch. ",
    "prepTime": "10 minutes",
    "cookTime": "20 minutes",
    "yeild": "4 servings",
    "ingredients": "\n8 ounces egg noodles\n2 tablespoons olive oil\n1 cup white onion, diced (1 medium)\n1 cup celery, diced (about 2 stalks)\n1 cup carrots, diced (2 medium carrots)\n2 cloves garlic, minced\n4 cups chicken stock, homemade or store bought\n2 cups shredded chicken, from a store-bought rotisserie chicken\n1 tablespoon melted butter\nSalt and pepper, to taste\nFresh parsley, garnish\nCrackers, for serving\n\n2 large eggs\n",
    "directions": "1 Cook the noodles: Bring a large pot of lightly salted water to a boil and cook the egg noodles according to package directions. Strain and toss with butter.\n\n2 Meanwhile, cook the veggies: In a large pot, warm the olive oil over medium heat. Add onions, celery, and carrot. Cook for 4 to 5 minutes until vegetables soften. Then add garlic and season with salt and pepper. Cook for another minute.\n\n3 Simmer the stock and chicken: Add chicken stock and bring soup to a simmer. Stir in shredded chicken and simmer for a few minutes to combine flavors. Taste soup and season with salt and pepper.\n\n4 Make the soft-boiled eggs (if using): Add 1/2-inch of water to a medium pot over high heat. Cover and bring to a rapid boil. Add the eggs and cover. The water will not completely cover the eggs. That’s okay. Return water to a rapid boil and cook eggs for 6 1/2 minutes.\nImmediately remove the pot from the heat and remove lid. Run the pot under cold water for 30 seconds to stop the cooking.\n\n5 Assemble the soup: Divide the egg noodles among the bowls and spoon in the soup. Once the eggs are cool enough to handle, peel them carefully and slide them into the bowl on top of the soup. Garnish with fresh parsley and serve with crackers.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/10/Rotisserie-Chicken-Soup-LEAD-3.jpg"
  },
  {
    "title": "Sheet Pan Hawaiian Chicken Recipe",
    "description": "Sheet pan dinners are lifesavers for busy humans, and this Sheet Pan Hawaiian Chicken is no exception. Combine chicken, peppers, and pineapple, bake, add a soy-ginger sauce, and serve. Boom! Dinner is done. ",
    "prepTime": "5 minutes",
    "cookTime": "25 minutes",
    "yeild": "2 to 4 servings",
    "ingredients": "\n1 pound thin-cut chicken breasts, sliced into strips\n1 (20-ounce) can pineapple chunks in juice, drained and juice reserved\n1 red bell pepper, seeded and cut into strips\n1 tablespoon extra-virgin olive oil\n1/2 teapsoon Kosher salt\n1/2 teaspoon freshly ground black pepper\n1/4 cup soy sauce or tamari (gluten free, if needed)\n1 tablespoon freshly grated ginger\nCooked rice, to serve\n",
    "directions": "1 Bake the chicken: Preheat the oven to 400°F. Arrange the chicken on a nonstick rimmed baking sheet (or line a rimmed sheet with aluminum foil).\nPlace the pineapple chunks and red pepper strips on and around the chicken. Drizzle with olive oil, season with salt and pepper, and bake for 20 minutes.\n \n2 Make the sauce: In a measuring cup, whisk together the soy sauce, 5 to 6 tablespoons of reserved pineapple juice, and the grated ginger. Set aside.\n\n3 Brush the chicken, pineapple, and peppers with the sauce: At the 20 minute-mark, remove the pan from the oven and generously brush the sauce all over the chicken, pineapple, and peppers.\nBake for an additional 5 to 7 minutes until the peppers start to look lightly browned around the edges and the pineapples have lightly caramelized.\n\n4 Remove and serve. Remove from the oven and serve immediately with rice and the extra sauce. Leftovers can be stored in covered containers in the fridge for up to 3 days.\n\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/10/Sheetpan-Hawaiian-Chicken-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Slow Cooker Shredded Chicken Chili Recipe",
    "description": "Slow Cooker Shredded Chicken Chili is perfect for busy weeks! Made with chicken thighs or breasts, onions, celery, black beans, frozen corn, chicken broth, tomato puree, and spices. So easy!",
    "prepTime": "10 minutes",
    "cookTime": "6 to 8 hours",
    "yeild": "6 to 8 servings",
    "ingredients": "\n2 to 2 1/2 pounds boneless, skinless chicken thighs\n1 large yellow onion, diced\n2 stalks celery, diced\n2 15-ounce cans tomato puree (about 3 cups)\n1 cup chicken broth\n4 cloves garlic, minced or pressed with a garlic press\n2 tablespoons chili powder\n1 teaspoon cumin\n1 teaspoon oregano\n1 teaspoon salt\n2 (15-ounce) cans black beans, drained and rinsed\n1 cup frozen corn kernels\n1 tablespoon cider vinegar\n\nDiced green onions\nShredded cheese\nDiced avocado\nChopped cilantro\nSour cream\n6-quart slow cooker",
    "directions": "1 Combine the chicken, diced onions, and diced celery in the bowl of a slow cooker: If you're using chicken breasts, cut them into 2 or 3 large pieces.\n\n2 Add the liquids and spices: Add the tomato puree, broth, garlic, and spices to the slow cooker. Stir to mix and coat the chicken and vegetables. (Note: Wait to add the beans, corn, and vinegar until the end of cooking.)\n\n3 Cover and cook on high for 2 to 4 hours, or low for 6 to 8 hours. It's fine if the chili ends up cooking a little longer on the \"low\" or \"warm,\" too.\n\n4 Shred the chicken using two forks. Shred the chicken right in the slow cooker; or if it feels easier, transfer the large pieces to a bowl, shred, and then return the chicken to the slow cooker. Taste the chili and add salt, pepper, or additional spices, if desired.\n\n5 Stir in the beans, corn, and vinegar, then cover and continue cooking until warmed through. This should take about 15 to 30 minutes. Watch for the chili to start bubbling again.\n\n6 Serve with toppings. Leftovers will keep refrigerated for up to a week or up to 3 months frozen.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2016/09/2016-09-28-Stubbs-Chicken-Chili-10.jpg"
  },
  {
    "title": "Herbed Chicken Tenders with Tomato Sauce Recipe",
    "description": "Chicken tenders, baked with an herbed breadcrumb coating, served with simple Italian tomato dipping sauce.",
    "prepTime": "10 minutes",
    "cookTime": "25 minutes",
    "yeild": "4 to 6 servings",
    "ingredients": "\n2 pounds chicken tenders (about 12 pieces)\n1 1/2 cups buttermilk (See Recipe Note)\n1 cup breadcrumbs\n2 tablespoons Italian seasoning herbs (See Recipe Note)\n1/2 teaspoon salt\n2 tablespoons butter, melted\n\n2 tablespoons extra virgin olive oil\n1/4 cup minced onion\n1 chopped garlic clove\n1 tablespoons tomato paste\n1 15-ounce can tomato sauce or crushed tomatoes\n1 teaspoon salt\n1 teaspoon sugar\n",
    "directions": "1 Soak tenders in buttermilk for 15 to 30 minutes. While the tenders are soaking, make the tomato dipping sauce.\n2 Make the tomato dipping sauce: Heat the olive oil in a pot over medium-high heat. Sauté the onions, stirring often, until translucent, about 3 minutes. Add the garlic and cook another minute.\nAdd the tomato paste, mix well and cook for 1 to 2 minutes more. The tomato paste should darken to a brick-red color.\nAdd the tomato sauce or crushed tomatoes, salt and sugar and bring to a boil. Cook this for 5 minutes if using tomato sauce, 10 minutes if using crushed tomatoes.\n3 Blend the dipping sauce: Put the sauce into a blender and purée until smooth. Hold your hand over the blender lid to keep it from popping off, and start the blender at a low setting and work up to the highest.\nThe sauce will keep in the fridge for up to a week.\n4 Heat oven to 500°F. Line a sheet pan with foil and set an oven-safe metal cooking rack inside. Baking the tenders on this rack will help get them crispy on all sides.\n5 Coat the tenders with breadcrumbs: Mix together the breadcrumbs, Italian seasoning, and salt in a shallow bowl. One by one, remove the chicken tenders from the buttermilk and place in the bowl with breadcrumbs, coating them on all sides with the breadcrumbs.\nPlace on the wire rack set inside the sheet pan, spaced slightly apart.\n6 Bake the tenders: Drizzle a little melted butter over each chicken tender. Place the pan in the oven and bake for about 12 minutes, until the chicken is cooked through and the pieces are lightly browned.\n7 Serve with a bowl of the sauce for dipping.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/09/chicken-tenders-tomato-sauce-vertical-a-1600.jpg"
  },
  {
    "title": "Sous Vide Sesame Chicken Recipe",
    "description": "If you love take-out Sesame Chicken, then you've got to try this sous vide version. The chicken stays tender and juicy, plus there's no need to deep-fry. A quick toss with a spicy sauce brings it all together.",
    "prepTime": "16 minutes",
    "cookTime": "2 hours",
    "yeild": "4 to 6 servings",
    "ingredients": "\n1 1/2 pounds chicken breast, cubed into 1-inch pieces\n1-inch piece fresh ginger, thinly sliced\n2 cloves garlic, smashed\n1 tablespoon sesame oil\n1 tablespoon soy sauce\n1 tablespoon rice wine vinegar\n\n1/4 cup soy sauce\n1/4 cup rice wine vinegar\n1/3 cup honey\n1 tablespoon cornstarch\n1/3 cup chicken stock or water\n1 tablespoon sesame seeds\n2 teaspoons sesame oil\n1 teaspoon chili garlic sauce (optional)\nSesame seeds, garnish\n\nCooked white rice\nScallions, green parts minced for garnish\nSous vide immersion circulatorGallon-sized, zip-top freezer bags",
    "directions": " 1 Heat the water: Fill a pot with water and place your immersion circulator inside. Set the temperature to 158°F and let the water come up to temperature.\n2 Prepare the chicken: Combine the cubed chicken breast along with ginger, garlic, sesame oil, soy, and rice wine vinegar to a gallon-sized zip-top freezer bag. Make sure the chicken is in a single layer.\n\n3 Seal the bag: Seal the bag with as little air as possible by using water-displacement method to help press out all the air: Just slowly lower the bag with the chicken into the water, letting the pressure of the water press the air through the top of the bag. Once the top of the bag reaches the water line and all the air has been pressed out, seal the bag. (Read more here.)\nYou can do this in the pot of water as it heats. (Just be careful if the water is already steaming!) Set the chicken aside on a kitchen towel until the water has finished heating. Seal it when it is submerged so most of the air is out of the bag.\n\n4 Cook the chicken:  Once the water has come to temperature, submerge the sealed bag of chicken. Make sure the bag is completely submerged so the food cooks evenly.\nCook the chicken for 2 hours. When cooking time ends, remove the chicken from the water and turn off the circulator.\n \n6 Make the sauce and combine with the chicken. Whisk together all of the sauce ingredients in a medium skillet. Bring to a simmer over medium heat; it and should start to thicken immediately.\nScoop out the chicken from the zip-top bag, discard the garlic and ginger, and add the chicken to the pan with the sauce. (The leftover cooking liquid can be saved and used in another recipe, if you like!)\nTurn heat down to low, and toss to coat and combine. The sauce should get very thick and stick to the chicken.\n7 Serve the chicken: Serve sesame chicken over rice garnished with sesame seeds and scallions.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/06/Sous-Vide-Sesame-LEAD-VERTICAL.jpg"
  },
  {
    "title": "Roast Chicken with Carrots Recipe",
    "description": "Roast Chicken with Carrots, roasted whole chicken in an oven-proof skillet, surrounded by carrots and garlic, and stuffed with lemon and thyme.",
    "prepTime": "15 minutes",
    "cookTime": "1 hour, 25 minutes",
    "yeild": "4 servings",
    "ingredients": "\nWhole fryer chicken, 3 1/2 to 4 pounds, preferably organic or kosher, wingtips removed\nSalt\nFreshly ground black pepper\n1 lemon, halved or quartered\n1 bunch fresh thyme\n10 cloves garlic, peeled\n8 carrots, peeled, trimmed and halved crosswise\n1 to 1½ cups chicken stock\n4 tablespoons extra-virgin olive oil\n1 Tbsp red-wine vinegar, more to taste\n",
    "directions": "1 Season and stuff the chicken: Preheat oven to 425°F (220°C). Rinse chicken and pat dry with paper towels. Season well with salt and pepper. Stuff with lemon, thyme and half of the garlic cloves.\n\n2 Truss the chicken: Using butcher's string, secure the wings and legs to the body.\n  \n3 Place chicken in a small roasting pan or large, deep, oven-proof heavy skillet. Surround with the carrots and remaining garlic, then add 1 cup of chicken stock. Drizzle with olive oil.\n\n4 Roast the chicken at 425°F (220°C). (If you are using a convection oven, start at 425°F (220°C) then reduce to 375°F (190°C) after the first 15 minutes.)\nRoast until chicken is golden and carrots are well caramelized, 1¼ to 1½ hours, basting with broth and pan juices every 15 minutes for the first 45 minutes. Add more stock if pan looks dry.\n5 Let chicken rest: Transfer chicken, carrots and garlic to a platter. Discard twine, thyme and lemon, and let chicken rest for 10 to 15 minutes.\n6 Add vinegar to pan juices: Skim fat from pan juices and discard. Add 1 Tbsp vinegar to remaining pan juices, taste and add more to taste. Serve over the chicken.\n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2007/01/roast-chicken-carrots-sally-horiz-a-1800.jpg"
  },
  {
    "title": "How to Cook Chicken in the Pressure Cooker Recipe",
    "description": "Need chicken fast? The pressure cooker is the way to go! This method is fast, simple, and fool proof. Keep the seasoning simple or mix it up depending on how you're serving the chicken. ",
    "prepTime": "5 minutes",
    "cookTime": "30 minutes",
    "yeild": "4 to 6 servings ",
    "ingredients": "\n1 1/2 to 2 pounds boneless skinless chicken breasts or thighs\n1 cup water\n1 teaspoon salt (use less if chicken is brined or otherwise pre-seasoned)\n2 bay leaves\n3 cloves garlic\n6-quart electric pressure cooker, such as the Instant Pot",
    "directions": "1 Add the chicken to the pressure cooker: Arrange the chicken in a single, even layer in the bottom of the pressure cooker. Add the water, then sprinkle with salt. Add the bay leaves and garlic.\n  \n2 Pressure cook the chicken: Secure the lid on the pressure cooker. Make sure that the pressure regulator is set to the “Sealing” position. Select the “Pressure Cook” or “Manual” program, then adjust the time to 10 minutes at high pressure.\nThe pressure cooker will take about 10 minutes to come up to full pressure. Cook time begins once it has reached full pressure.\n\n3 Release the pressure: As soon as the timer goes off at the end of cooking, perform a quick pressure release by moving the pressure release knob from “Sealing” to “Venting.” It will take a minute or two for the pressure to release completely.\nOpen the pot, then use a digital thermometer to check the thickest part of a piece of chicken—it should be at least 165ºF. (If the chicken is not quite up to temperature, put the lid back on with the vent closed and cook for another minute or two.)\n  \n4 Use the chicken: Use a pair of tongs to transfer the chicken to a dish, and let it rest for 10 minutes. Slice, shred, or cube the chicken as needed, or refrigerate in a lidded container for up to 5 days.\nIf you want to save the cooking liquid (it is now a lightly flavorful chicken broth), strain out the bay leaves and garlic. Transfer to a tightly lidded container and store in the refrigerator for 3 to 4 days, or frozen for up to 6 months.\n \n\n                    ",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2018/09/HT-Boneless-Chicken-LEAD-VERTICAL.jpg"
  }
]
